anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
#include <array>
#include <cstdlib>
#include <cstring>
#include <iostream>
#include <map>
#include <string>
#include <utility>
#include <vector>

#include "apps/capture/RadiotapPcap.h"
#include "apps/capture/WifiFrameCapture.h"
#include "apps/survey/SurveyController.h"
#include "apps/survey/ProductSurveyAdmission.h"
#include "apps/survey/SurveyPipeline.h"
#include "apps/survey/SurveySourceController.h"
#include "apps/survey/SurveyWorkflow.h"
#include "apps/library/LibraryController.h"
#include "apps/library/SessionCatalog.h"
#include "apps/self_test/SelfTestController.h"
#include "apps/spectrum/Cc1101SpectrumController.h"
#include "apps/spectrum/Nrf24SpectrumController.h"
#include "domain/apps/AppCatalog.h"
#include "domain/hardware/HardwareInventory.h"
#include "drivers/ble/BlePassiveContract.h"
#include "drivers/radio/ShieldReceiverIdentity.h"
#include "drivers/radio/Cc1101PassiveSpectrum.h"
#include "drivers/radio/Nrf24PassiveSpectrum.h"
#include "drivers/wifi/WifiPassiveContract.h"
#include "kernel/runtime/AppRuntime.h"
#include "kernel/runtime/ResourceBroker.h"
#include "platform/arduino/RamSessionStoreIo.h"
#include "services/diagnostics/BootReport.h"
#include "services/diagnostics/HilSession.h"
#include "services/survey/IngressTiming.h"
#include "services/survey/ObservationQueue.h"
#include "services/survey/SessionBatchPolicy.h"
#include "services/survey/SourceDegradation.h"
#include "services/survey/SourceTimeline.h"
#include "services/survey/SurveySession.h"
#include "storage/AtomicHead.h"
#include "storage/MediaDiscovery.h"
#include "storage/MountPolicy.h"
#include "storage/ProductStorePolicy.h"
#include "storage/ProductBootRetry.h"
#include "storage/ProductStartRetry.h"
#include "storage/SdReadOnlyProtocol.h"
#include "storage/SdIdentification.h"
#include "storage/SdIdentificationTransport.h"
#include "storage/SdSectorInspection.h"
#include "storage/SdSpiWireCodec.h"
#include "storage/SessionCodec.h"
#include "storage/SessionStore.h"
#include "storage/SessionStoreBoundary.h"
#include "storage/SessionStoreIoRouter.h"
#include "storage/StorageGuard.h"
#include "storage/StorageTiming.h"
#include "ui/Pcf8574ButtonInput.h"
#include "ui/TouchInput.h"
#include "ui/TouchTargets.h"
#include "ui/LanguageController.h"
#include "ui/UiController.h"
#include "ui/UiStrings.h"
#include "ui/VisualTheme.h"
#include "ui/UiComponents.h"

using namespace leshy1::domain::apps;
using namespace leshy1::domain::hardware;
using namespace leshy1::domain::observations;
using namespace leshy1::drivers::wifi;
using namespace leshy1::drivers::radio;
using namespace leshy1::kernel::runtime;
using namespace leshy1::services::diagnostics;
using namespace leshy1::services::survey;
using namespace leshy1::storage;
using namespace leshy1::ui;
using namespace leshy1::apps::survey;
using namespace leshy1::apps::library;
using namespace leshy1::apps::self_test;
using namespace leshy1::apps::capture;
using namespace leshy1::apps::spectrum;

namespace {

int failures = 0;

#define CHECK(expression)                                                                       \
    do {                                                                                        \
        if (!(expression)) {                                                                    \
            std::cerr << __FILE__ << ':' << __LINE__ << ": check failed: " #expression << '\n'; \
            ++failures;                                                                         \
        }                                                                                       \
    } while (false)

void testVisualThemeContract() {
    using leshy1::ui::visual::Layout;
    using leshy1::ui::visual::Palette;
    using leshy1::ui::visual::rgb565;

    CHECK(Layout::ScreenWidth == 240);
    CHECK(Layout::ScreenHeight == 320);
    CHECK(Layout::Edge * 2 + Layout::ContentWidth == Layout::ScreenWidth);
    CHECK(Layout::ContentTop + 3 * (Layout::RowHeight + Layout::RowGap) <
          Layout::FooterDividerY);
    CHECK(Layout::ContentTop + 3 * Layout::HomeRowHeight +
              2 * Layout::HomeRowGap < Layout::FooterDividerY);
    CHECK(Layout::HomeRowHeight >= 44);
    CHECK(Palette::Canvas == rgb565(7, 16, 12));
    CHECK(Palette::Header != Palette::Canvas);
    CHECK(Palette::Surface != Palette::SurfaceFocus);
    CHECK(Palette::TextPrimary != Palette::TextSecondary);
    CHECK(Palette::Focus != Palette::Positive);
    CHECK(Palette::Warning != Palette::Danger);
}

void testUiComponentGeometryContract() {
    using leshy1::ui::visual::Components;
    using leshy1::ui::visual::Layout;
    using leshy1::ui::visual::Rect;
    using leshy1::ui::visual::beforeFooter;
    using leshy1::ui::visual::contains;
    using leshy1::ui::visual::containsPoint;
    using leshy1::ui::visual::insideScreen;
    using leshy1::ui::visual::overlaps;

    CHECK(insideScreen(Components::header()));
    CHECK(insideScreen(Components::title()));
    for (std::uint8_t index = 0; index < 3; ++index) {
        const Rect row = Components::homeRow(index);
        CHECK(beforeFooter(row));
        CHECK(contains(row, Components::focusMarker(row)));
        if (index != 0) {
            const Rect previous = Components::homeRow(index - 1);
            CHECK(!overlaps(previous, row));
            CHECK(row.y - previous.y ==
                  Layout::HomeRowHeight + Layout::HomeRowGap);
        }
    }
    for (std::uint8_t index = 0; index < 3; ++index) {
        const Rect row = Components::choiceRow(index);
        CHECK(beforeFooter(row));
        if (index != 0) {
            CHECK(!overlaps(Components::choiceRow(index - 1), row));
        }
    }
    CHECK(Components::ChoiceHeight >= 44);
    CHECK(containsPoint(Components::homeRow(0), Layout::Edge, Layout::ContentTop));
    CHECK(!containsPoint(Components::homeRow(0), Layout::Edge - 1,
                         Layout::ContentTop));
    CHECK(!containsPoint(Components::footerHint(), Layout::Edge,
                         Layout::ContentTop));
    CHECK(beforeFooter(Components::metricRow(4)));
    CHECK(beforeFooter(Components::stateCard()));
    CHECK(!overlaps(Components::footerDivider(), Components::inputStatus()));
    CHECK(!overlaps(Components::inputStatus(), Components::footerHint()));
    for (std::uint8_t index = 0; index < 3; ++index) {
        CHECK(insideScreen(Components::navigationCell(index)));
        CHECK(contains(Components::footerHint(),
                       Components::navigationCell(index)));
        if (index != 0) {
            CHECK(!overlaps(Components::navigationCell(index - 1),
                            Components::navigationCell(index)));
        }
    }
}

void testTouchInputIsEdgeTriggeredAndBounded() {
    TouchInput input;
    TouchPoint press;
    input.reset(100);
    CHECK(!input.sample(false, 0, 0, 100, &press));
    CHECK(input.sample(true, 12, 82, 110, &press));
    CHECK(press.x == 12 && press.y == 82);
    CHECK(input.pressed());
    CHECK(!input.sample(true, 12, 82, 120, &press));
    CHECK(!input.sample(false, 0, 0, 125, &press));
    CHECK(!input.sample(true, 13, 83, 130, &press));
    CHECK(input.pressed());
    CHECK(!input.sample(false, 0, 0, 140, &press));
    CHECK(!input.sample(false, 0, 0, 174, &press));
    CHECK(input.pressed());
    CHECK(!input.sample(false, 0, 0, 175, &press));
    CHECK(!input.pressed());
    CHECK(!input.sample(true, 240, 10, 180, &press));
    CHECK(input.sample(true, 239, 319, 190, &press));
    const TouchInputMetrics& metrics = input.metrics();
    CHECK(metrics.pressEvents == 2);
    CHECK(metrics.releaseEvents == 1);
    CHECK(metrics.rejectedCoordinates == 1);
    CHECK(metrics.lastX == 239 && metrics.lastY == 319);
}

void testTouchTargetsExposeRowsButNeverChrome() {
    using leshy1::ui::visual::Components;
    using leshy1::ui::visual::Layout;

    const auto center = [](leshy1::ui::visual::Rect rect) {
        return TouchPoint{
            static_cast<std::uint16_t>(rect.x + rect.width / 2),
            static_cast<std::uint16_t>(rect.y + rect.height / 2)};
    };
    TouchTarget target = hitTouchTarget(
        TouchTargetLayout::HomeRows, center(Components::homeRow(1)), 2, 6);
    CHECK(target.hit && target.index == 3);
    target = hitTouchTarget(TouchTargetLayout::HomeRows,
                            center(Components::homeRow(2)), 4, 6);
    CHECK(!target.hit);
    target = hitTouchTarget(TouchTargetLayout::ThreeChoices,
                            center(Components::choiceRow(2)));
    CHECK(target.hit && target.index == 2);
    target = hitTouchTarget(TouchTargetLayout::TwoChoices,
                            center(Components::choiceRow(2)));
    CHECK(!target.hit);
    target = hitTouchTarget(TouchTargetLayout::HomeRows,
                            {20, static_cast<std::uint16_t>(Layout::HintY)},
                            0, 6);
    CHECK(!target.hit);
    target = hitTouchTarget(TouchTargetLayout::HomeRows, {20, 20}, 0, 6);
    CHECK(!target.hit);
}

void testLanguageCatalogAndControllerAreBounded() {
    CHECK(kUiTextCount > 80);
    for (std::size_t index = 0; index < kUiTextCount; ++index) {
        const UiTextSpec& spec = uiTextSpec(static_cast<UiTextId>(index));
        CHECK(spec.english != nullptr && spec.english[0] != '\0');
        CHECK(spec.russian != nullptr && spec.russian[0] != '\0');
        CHECK(spec.maximumPixels > 0 && spec.maximumPixels <= 212);
    }
    CHECK(std::strcmp(uiText(UiLanguage::English, UiTextId::AppSelfTest),
                      "SELF-TEST") == 0);
    CHECK(std::strcmp(uiText(UiLanguage::Russian, UiTextId::AppSelfTest),
                      u8"САМОПРОВЕРКА") == 0);
    CHECK(std::strcmp(uiText(UiLanguage::Russian, UiTextId::NavBack),
                      u8"НАЗАД") == 0);
    CHECK(std::strcmp(uiText(UiLanguage::Russian, UiTextId::NavSelect),
                      u8"ВЫБОР") == 0);
    CHECK(std::strcmp(uiText(UiLanguage::Russian, UiTextId::NavEnter),
                      u8"ВХОД") == 0);

    UiLanguage parsed = UiLanguage::English;
    CHECK(uiLanguageFromName("ru", &parsed));
    CHECK(parsed == UiLanguage::Russian);
    CHECK(!uiLanguageFromName("de", &parsed));

    LanguageController controller;
    CHECK(controller.active() == UiLanguage::English);
    CHECK(controller.selection() == 0);
    CHECK(controller.next());
    CHECK(controller.selected() == UiLanguage::Russian);
    CHECK(controller.apply());
    CHECK(controller.active() == UiLanguage::Russian);
    controller.enter();
    CHECK(controller.selection() == 1);
    CHECK(controller.previous());
    CHECK(controller.apply());
    CHECK(controller.active() == UiLanguage::English);
    controller.restore(UiLanguage::Russian);
    CHECK(controller.active() == UiLanguage::Russian);
    CHECK(controller.selection() == 1);
}

void testSelfTestQuickIsReadOnlyBoundedAndFullFailsClosed() {
    SelfTestFacts healthy;
    healthy.buildIdentityPresent = true;
    healthy.profileMatched = true;
    healthy.displayReady = true;
    healthy.touchFrontendReady = true;
    healthy.inputFrontendReady = true;
    healthy.inputQueueHealthy = true;
    healthy.buzzerInactive = true;
    healthy.resourceScopeClean = true;
    healthy.heapFree = 220U * 1024U;
    healthy.heapMinimum = 180U * 1024U;
    healthy.inputQueueDrops = 0;
    healthy.activeResources = resourceMask(Resource::UiForeground);
    healthy.persistentSurveyReady = true;
    healthy.passiveBleReady = true;
    healthy.passiveWifiCaptureReady = true;
    healthy.enrolledStorageReady = true;
    healthy.persistentLibraryReady = true;
    healthy.persistentWifiCaptureReady = true;
    healthy.shieldReceiversApplicable = true;
    healthy.shieldReceiverProbeComplete = true;
    healthy.shieldReceiverProbePassed = true;
    healthy.nrf24SpectrumExerciseComplete = true;
    healthy.nrf24SpectrumExercisePassed = true;
    healthy.cc1101SpectrumExerciseComplete = true;
    healthy.cc1101SpectrumExercisePassed = true;
    healthy.persistentRecoveryAuditComplete = true;
    healthy.persistentRecoveryAuditPassed = true;
    healthy.libraryExportAuditComplete = true;
    healthy.libraryExportAuditPassed = true;
    healthy.capturePcapAuditComplete = true;
    healthy.capturePcapAuditApplicable = true;
    healthy.capturePcapAuditPassed = true;
    healthy.disposableCommitComplete = true;
    healthy.disposableCommitPassed = true;
    healthy.disposableRemountComplete = true;
    healthy.disposableRemountPassed = true;
    healthy.disposableExportComplete = true;
    healthy.disposableExportPassed = true;
    healthy.disposableCleanupComplete = true;
    healthy.disposableCleanupPassed = true;
    healthy.disposableStorageWriteCalls = 3;
    healthy.disposableStorageWriteBytes = 1024;

    SelfTestController controller;
    CHECK(controller.view() == SelfTestView::ModeMenu);
    CHECK(controller.selection() == 0);
    CHECK(controller.selectedMode() == SelfTestMode::Quick);
    CHECK(!controller.previousMode());
    CHECK(controller.activate(healthy, 100));
    CHECK(controller.runAwaitingFinish());
    controller.finishRun(125);
    CHECK(!controller.runAwaitingFinish());
    CHECK(controller.view() == SelfTestView::Result);
    CHECK(controller.hasReport());
    const SelfTestReport& quick = controller.report();
    CHECK(quick.mode == SelfTestMode::Quick);
    CHECK(quick.status == SelfTestResultStatus::Pass);
    CHECK(quick.checkCount == 9);
    CHECK(quick.passed == 9);
    CHECK(quick.failed == 0);
    CHECK(quick.blocked == 0);
    CHECK(quick.readOnly);
    CHECK(quick.durationUs == 25);
    CHECK(std::strcmp(quick.checks[0].id, "quick.build.identity") == 0);
    CHECK(std::strcmp(quick.checks[4].id, "quick.input.touch") == 0);
    CHECK(std::strcmp(quick.checks[8].id, "quick.resource.scope") == 0);

    CHECK(controller.back());
    CHECK(controller.nextMode());
    CHECK(controller.selectedMode() == SelfTestMode::FullGuided);
    CHECK(controller.activate(healthy, 200));
    CHECK(controller.view() == SelfTestView::Preflight);
    CHECK(!controller.runAwaitingFinish());
    CHECK(controller.activate(healthy, 210));
    CHECK(controller.view() == SelfTestView::VisualCheck);
    CHECK(controller.runAwaitingFinish());
    CHECK(controller.visualState() == 0);
    CHECK(std::strcmp(selfTestVisualStateName(controller.visualState()),
                      "dialog_confirm") == 0);
    for (std::uint8_t state = 1; state < SelfTestController::kVisualStateCount;
         ++state) {
        CHECK(controller.activate(healthy, 220 + state));
        CHECK(controller.view() == SelfTestView::VisualCheck);
        CHECK(controller.visualState() == state);
    }
    CHECK(controller.activate(healthy, 230));
    CHECK(controller.view() == SelfTestView::ActiveChecks);
    CHECK(controller.completeActiveChecks(healthy, 240));
    CHECK(controller.view() == SelfTestView::Result);
    CHECK(std::strcmp(selfTestVisualStateName(1), "unavailable") == 0);
    CHECK(std::strcmp(selfTestVisualStateName(2), "degraded") == 0);
    CHECK(std::strcmp(selfTestVisualStateName(3), "error") == 0);
    CHECK(std::strcmp(selfTestVisualStateName(4), "running") == 0);
    CHECK(std::strcmp(selfTestVisualStateName(5), "none") == 0);
    const SelfTestReport& full = controller.report();
    CHECK(full.mode == SelfTestMode::FullGuided);
    CHECK(full.status == SelfTestResultStatus::Blocked);
    CHECK(!full.readOnly);
    CHECK(full.sequence == 2);
    CHECK(full.checkCount == 30);
    CHECK(full.passed == 26);
    CHECK(full.failed == 0);
    CHECK(full.blocked == 1);
    CHECK(full.notApplicable == 3);
    CHECK(std::strcmp(full.checks[9].id, "full.ui.common_states") == 0);
    CHECK(std::strcmp(full.checks[10].id,
                      "full.s3.survey.persistence") == 0);
    CHECK(std::strcmp(full.checks[15].id,
                      "full.s4.capture.persistence") == 0);
    CHECK(std::strcmp(full.checks[16].id, "full.assembly.gps") == 0);
    CHECK(full.checks[16].status == SelfTestResultStatus::NotApplicable);
    CHECK(std::strcmp(full.checks[19].id,
                      "full.s4.shield.receivers") == 0);
    CHECK(full.checks[19].status == SelfTestResultStatus::Pass);
    CHECK(std::strcmp(full.checks[20].id,
                      "full.s4.spectrum.nrf24.receive") == 0);
    CHECK(full.checks[20].status == SelfTestResultStatus::Pass);
    CHECK(std::strcmp(full.checks[21].id,
                      "full.s4.spectrum.cc1101.receive") == 0);
    CHECK(full.checks[21].status == SelfTestResultStatus::Pass);
    CHECK(std::strcmp(full.checks[22].id,
                      "full.s4.storage.recovery.audit") == 0);
    CHECK(full.checks[22].status == SelfTestResultStatus::Pass);
    CHECK(std::strcmp(full.checks[23].id,
                      "full.s4.library.export.audit") == 0);
    CHECK(full.checks[23].status == SelfTestResultStatus::Pass);
    CHECK(std::strcmp(full.checks[24].id,
                      "full.s4.capture.pcap.audit") == 0);
    CHECK(full.checks[24].status == SelfTestResultStatus::Pass);
    CHECK(std::strcmp(full.checks[25].id,
                      "full.s4.storage.disposable.commit") == 0);
    CHECK(full.checks[25].status == SelfTestResultStatus::Pass);
    CHECK(std::strcmp(full.checks[26].id,
                      "full.s4.storage.disposable.remount") == 0);
    CHECK(full.checks[26].status == SelfTestResultStatus::Pass);
    CHECK(std::strcmp(full.checks[27].id,
                      "full.s4.library.disposable.export") == 0);
    CHECK(full.checks[27].status == SelfTestResultStatus::Pass);
    CHECK(std::strcmp(full.checks[28].id,
                      "full.s4.storage.disposable.cleanup") == 0);
    CHECK(full.checks[28].status == SelfTestResultStatus::Pass);
    CHECK(std::strcmp(full.checks[29].id,
                      "full.capability.coverage") == 0);
    CHECK(std::strcmp(selfTestResultStatusName(
                          SelfTestResultStatus::NotApplicable),
                      "not_applicable") == 0);
    CHECK(SelfTestReport::kPlanVersion == 8);

    CHECK(controller.back());
    CHECK(controller.previousMode());
    SelfTestFacts failed = healthy;
    failed.buzzerInactive = false;
    failed.inputQueueDrops = 1;
    CHECK(controller.activate(failed, 300));
    controller.finishRun(290);
    CHECK(controller.report().status == SelfTestResultStatus::Fail);
    CHECK(controller.report().failed == 2);
    CHECK(controller.report().durationUs == 0);
    CHECK(!controller.activate(healthy, 400));

    SelfTestFacts incomplete = healthy;
    incomplete.passiveBleReady = false;
    incomplete.gpsDeclared = true;
    SelfTestController coverageFailure;
    CHECK(coverageFailure.nextMode());
    CHECK(coverageFailure.activate(incomplete, 500));
    CHECK(coverageFailure.activate(incomplete, 510));
    for (std::uint8_t state = 1;
         state < SelfTestController::kVisualStateCount; ++state) {
        CHECK(coverageFailure.activate(incomplete, 510 + state));
    }
    CHECK(coverageFailure.activate(incomplete, 520));
    CHECK(coverageFailure.view() == SelfTestView::ActiveChecks);
    CHECK(coverageFailure.completeActiveChecks(incomplete, 530));
    const SelfTestReport& incompleteReport = coverageFailure.report();
    CHECK(incompleteReport.status == SelfTestResultStatus::Fail);
    CHECK(incompleteReport.passed == 25);
    CHECK(incompleteReport.failed == 1);
    CHECK(incompleteReport.blocked == 2);
    CHECK(incompleteReport.notApplicable == 2);

    SelfTestFacts degradedHeap = healthy;
    degradedHeap.heapMinimum = degradedHeap.heapFloor - 1U;
    SelfTestController finalHeapFailure;
    CHECK(finalHeapFailure.nextMode());
    CHECK(finalHeapFailure.activate(healthy, 540));
    CHECK(finalHeapFailure.activate(healthy, 550));
    for (std::uint8_t state = 1;
         state < SelfTestController::kVisualStateCount; ++state) {
        CHECK(finalHeapFailure.activate(healthy, 550 + state));
    }
    CHECK(finalHeapFailure.activate(healthy, 560));
    CHECK(finalHeapFailure.completeActiveChecks(degradedHeap, 570));
    const SelfTestReport& heapFailure = finalHeapFailure.report();
    CHECK(heapFailure.status == SelfTestResultStatus::Fail);
    CHECK(heapFailure.checks[2].status == SelfTestResultStatus::Fail);
    CHECK(heapFailure.passed == 25);
    CHECK(heapFailure.failed == 1);
    CHECK(heapFailure.blocked == 1);
    CHECK(heapFailure.notApplicable == 3);

    SelfTestFacts unprobed = healthy;
    unprobed.shieldReceiverProbeComplete = false;
    unprobed.shieldReceiverProbePassed = false;
    SelfTestController blockedProbe;
    CHECK(blockedProbe.nextMode());
    CHECK(blockedProbe.activate(unprobed, 600));
    CHECK(blockedProbe.activate(unprobed, 610));
    for (std::uint8_t state = 1;
         state < SelfTestController::kVisualStateCount; ++state) {
        CHECK(blockedProbe.activate(unprobed, 610 + state));
    }
    CHECK(blockedProbe.activate(unprobed, 620));
    CHECK(blockedProbe.completeActiveChecks(unprobed, 630));
    CHECK(blockedProbe.report().passed == 25);
    CHECK(blockedProbe.report().failed == 0);
    CHECK(blockedProbe.report().blocked == 2);
    CHECK(blockedProbe.report().notApplicable == 3);

