anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
void testIngressRateSummaryUsesNearestRankAndRejectsZero() {
    std::array<std::uint64_t, 20> rates{};
    for (std::size_t index = 0; index < rates.size(); ++index) {
        rates[index] = static_cast<std::uint64_t>((rates.size() - index) * 100U);
    }
    const IngressRateSummary summary =
        summarizeIngressRates(rates.data(), rates.size());
    CHECK(summary.valid);
    CHECK(summary.samples == rates.size());
    CHECK(summary.minimumBytesPerSecond == 100);
    CHECK(summary.p50BytesPerSecond == 1000);
    CHECK(summary.p95BytesPerSecond == 1900);
    CHECK(summary.p99BytesPerSecond == 2000);
    CHECK(summary.maximumBytesPerSecond == 2000);
    CHECK(!summarizeIngressRates(nullptr, 1).valid);
    rates[0] = 0;
    CHECK(!summarizeIngressRates(rates.data(), rates.size()).valid);
    CHECK(!summarizeIngressRates(
        rates.data(), kIngressTimingMaxSamples + 1U).valid);
}

void testObservationQueueIsBoundedFifoAndScrubbable() {
    ObservationQueue queue;
    Observation observation;
    for (std::size_t index = 0; index < ObservationQueue::kCapacity; ++index) {
        observation.sequence = index + 1U;
        observation.identity[0] = static_cast<std::uint8_t>(index + 1U);
        observation.identityLength = 1;
        CHECK(queue.push(observation));
    }
    CHECK(queue.full());
    CHECK(queue.size() == ObservationQueue::kCapacity);
    CHECK(queue.highWater() == ObservationQueue::kCapacity);
    CHECK(queue.pushed() == ObservationQueue::kCapacity);

    observation.sequence = 999;
    CHECK(!queue.push(observation));
    CHECK(queue.dropped() == 1);
    CHECK(queue.size() == ObservationQueue::kCapacity);

    Observation popped;
    for (std::size_t index = 0; index < 8; ++index) {
        CHECK(queue.pop(&popped));
        CHECK(popped.sequence == index + 1U);
        CHECK(popped.identityLength == 1);
    }
    CHECK(queue.size() == ObservationQueue::kCapacity - 8U);
    CHECK(queue.popped() == 8);

    for (std::size_t index = 0; index < 8; ++index) {
        observation = Observation{};
        observation.sequence = 100U + index;
        CHECK(queue.push(observation));
    }
    CHECK(queue.full());
    for (std::size_t index = 8; index < ObservationQueue::kCapacity; ++index) {
        CHECK(queue.pop(&popped));
        CHECK(popped.sequence == index + 1U);
    }
    for (std::size_t index = 0; index < 8; ++index) {
        CHECK(queue.pop(&popped));
        CHECK(popped.sequence == 100U + index);
    }
    CHECK(queue.empty());
    CHECK(!queue.pop(&popped));
    CHECK(!queue.pop(nullptr));
    CHECK(queue.pushed() == ObservationQueue::kCapacity + 8U);
    CHECK(queue.popped() == ObservationQueue::kCapacity + 8U);

    queue.reset();
    CHECK(queue.empty());
    CHECK(queue.highWater() == 0);
    CHECK(queue.pushed() == 0);
    CHECK(queue.popped() == 0);
    CHECK(queue.dropped() == 0);
}

void testSessionBatchPolicyMeetsMeasuredRateAndFlushesBoundedly() {
    const SessionBatchPolicy policy;
    CHECK(validateSessionBatchPolicy(policy));
    CHECK(policy.observationCapacity == ObservationQueue::kCapacity);
    CHECK(minimumBatchBytesForRate(546, 4, 591651) == 1293);
    CHECK(minimumBatchBytesForRate(0, 4, 591651) == 0);
    CHECK(minimumBatchBytesForRate(546, 0, 591651) == 0);
    CHECK(minimumBatchBytesForRate(546, 4, 0) == 0);
    CHECK(minimumBatchBytesForRate(UINT64_MAX, 2, 1) == 0);
    CHECK(minimumBatchBytesForRate(UINT64_MAX / 2U, 1, 3) == 0);

    SessionBatchPolicy invalid = policy;
    invalid.observationCapacity = 0;
    CHECK(!validateSessionBatchPolicy(invalid));
    invalid = policy;
    invalid.observationCapacity = ObservationQueue::kCapacity + 1U;
    CHECK(!validateSessionBatchPolicy(invalid));
    invalid = policy;
    invalid.targetEncodedBytes = kSegmentFooterBytes;
    CHECK(!validateSessionBatchPolicy(invalid));
    invalid = policy;
    invalid.maximumLatencyUs = 0;
    CHECK(!validateSessionBatchPolicy(invalid));

    CHECK(sessionBatchTrigger(policy, 0, 0, 0, 0, false, false) ==
          SessionBatchTrigger::None);
    CHECK(sessionBatchTrigger(policy, 1, 1024, 1000, 2000, false, false) ==
          SessionBatchTrigger::None);
    CHECK(sessionBatchTrigger(policy, policy.observationCapacity, 1024,
                              1000, 2000, false, false) ==
          SessionBatchTrigger::Capacity);
    CHECK(sessionBatchTrigger(policy, 1, policy.targetEncodedBytes,
                              1000, 2000, false, false) ==
          SessionBatchTrigger::EncodedSize);
    CHECK(sessionBatchTrigger(policy, 1, 1024, 1000,
                              1000 + policy.maximumLatencyUs,
                              false, false) == SessionBatchTrigger::Latency);
    CHECK(sessionBatchTrigger(policy, 1, policy.targetEncodedBytes,
                              1000, 1000 + policy.maximumLatencyUs,
                              true, false) == SessionBatchTrigger::Stop);
    CHECK(sessionBatchTrigger(policy, policy.observationCapacity,
                              policy.targetEncodedBytes, 1000,
                              1000 + policy.maximumLatencyUs,
                              true, true) == SessionBatchTrigger::SafeShutdown);
    CHECK(std::strcmp(sessionBatchTriggerName(SessionBatchTrigger::Capacity),
                      "capacity") == 0);
}

void testInventoryIsFixedAndRejectsDuplicates() {
    HardwareInventory inventory;
    CHECK(inventory.add({"board.profile", CapabilityState::Available, "runtime", "match"}));
    CHECK(!inventory.add({"board.profile", CapabilityState::Fault, "runtime", "duplicate"}));
    CHECK(inventory.size() == 1);
    CHECK(inventory.find("missing") == nullptr);
    CHECK(inventory.find("board.profile") != nullptr);
    CHECK(std::strcmp(capabilityStateName(CapabilityState::Conflicted), "conflicted") == 0);
}

void testBootReportIsBoundedAndMachineReadable() {
    BootMetrics metrics;
    metrics.version = "0.1.0-measure";
    metrics.profile = "esp32-div-v2-n16";
    metrics.profileRevision = "S1-test";
    metrics.appElfSha256 =
        "0123456789abcdef0123456789abcdef0123456789abcdef0123456789abcdef";
    metrics.setupEnterUs = 10;
    metrics.runtimeReadyUs = 20;
    metrics.displayReadyUs = 30;
    metrics.inputReadyUs = 40;
    metrics.interactiveReadyUs = 50;
    metrics.resetReason = 1;
    metrics.flashBytes = 16777216;
    metrics.heapTotal = 387360;
    metrics.heapFree = 300000;
    metrics.heapMinimum = 290000;
    metrics.buzzerSafetyConfigured = true;
    metrics.buzzerInactive = true;
    metrics.inputDetected = true;
    metrics.inputRaw = 255;
    metrics.inputProbeAttempts = 2;
    metrics.inputProbeTransientRetries = 1;
    char output[768] = {};
    CHECK(formatBootMetrics(metrics, output, sizeof(output)));
    CHECK(std::strstr(output, "\"legacy_sources\":false") != nullptr);
    CHECK(std::strstr(output,
                      "\"app_elf_sha256\":\"0123456789abcdef0123456789abcdef"
                      "0123456789abcdef0123456789abcdef\"") != nullptr);
    CHECK(std::strstr(output, "\"flash_bytes\":16777216") != nullptr);
    CHECK(std::strstr(output, "\"interactive_ready_us\":50") != nullptr);
    CHECK(std::strstr(output, "\"buzzer_safety_configured\":true") != nullptr);
    CHECK(std::strstr(output, "\"buzzer_inactive\":true") != nullptr);
    CHECK(std::strstr(output, "\"input_detected\":true") != nullptr);
    CHECK(std::strstr(output, "\"input_probe_attempts\":2") != nullptr);
    CHECK(std::strstr(output, "\"input_probe_transient_retries\":1") != nullptr);

    char tooSmall[8] = {};
    CHECK(!formatBootMetrics(metrics, tooSmall, sizeof(tooSmall)));

    const CapabilityRecord record{"storage.sd", CapabilityState::Unknown, "HW-U06",
                                  "explicit_mount_not_run"};
    CHECK(formatCapability(record, output, sizeof(output)));
    CHECK(std::strstr(output, "\"state\":\"unknown\"") != nullptr);
}

void testHilSessionBindsOneRunToTheRunningAppIdentity() {
    constexpr const char* sessionOne = "0123456789abcdef0123456789abcdef";
    constexpr const char* sessionTwo = "fedcba9876543210fedcba9876543210";
    constexpr const char* identity =
        "0123456789abcdef0123456789abcdef0123456789abcdef0123456789abcdef";
    constexpr const char* otherIdentity =
        "1123456789abcdef0123456789abcdef0123456789abcdef0123456789abcdef";
    HilSession session;
    CHECK(session.begin("short", identity, identity) ==
          HilSessionStatus::InvalidSessionId);
    CHECK(session.begin(sessionOne, "invalid", identity) ==
          HilSessionStatus::InvalidAppIdentity);
    CHECK(session.begin(sessionOne, otherIdentity, identity) ==
          HilSessionStatus::AppIdentityMismatch);
    CHECK(session.begin(sessionOne, identity, identity) == HilSessionStatus::Begun);
    CHECK(session.active());
    CHECK(std::strcmp(session.id(), sessionOne) == 0);
    CHECK(session.begin(sessionTwo, identity, identity) ==
          HilSessionStatus::AlreadyActive);
    CHECK(session.end(sessionTwo) == HilSessionStatus::SessionMismatch);
    CHECK(session.active());
    CHECK(session.end(sessionOne) == HilSessionStatus::Ended);
    CHECK(!session.active());
    CHECK(session.end(sessionOne) == HilSessionStatus::NotActive);
    CHECK(session.begin(sessionTwo, identity, identity) == HilSessionStatus::Begun);
    CHECK(std::strcmp(hilSessionStatusName(HilSessionStatus::Begun), "begun") == 0);
}

void testPhysicalAndDiagnosticActionsShareNavigation() {
    UiController controller;
    CHECK(controller.isRoot());
    CHECK(controller.selection() == 0);
    CHECK(uiActionFromName("down") == UiAction::Down);
    CHECK(uiActionFromName("invalid") == UiAction::Unknown);

    CHECK(controller.apply(UiAction::Down, 3, true));
    CHECK(controller.selection() == 1);
    CHECK(!controller.apply(uiActionFromName("select"), 3, false));
    CHECK(controller.isRoot());
    CHECK(controller.revision() == 2);
    CHECK(controller.apply(uiActionFromName("select"), 3, true, 2));
    CHECK(controller.page() == 2);
    CHECK(std::strcmp(probePageName(controller.page()), "survey") == 0);
    CHECK(controller.apply(uiActionFromName("back"), 3, true));
    CHECK(controller.isRoot());
    CHECK(controller.selection() == 1);
    CHECK(controller.revision() == 4);
    controller.recordHandledAction(UiAction::Right);
    CHECK(controller.revision() == 5);
    controller.recordHandledAction(UiAction::Unknown);
    CHECK(controller.revision() == 5);

    UiController nested;
    CHECK(nested.apply(UiAction::Select, 1, true, 9));
    CHECK(nested.page() == 9);
    CHECK(nested.openChild(5));
    CHECK(nested.page() == 5);
    CHECK(nested.parentPage() == 9);
    CHECK(nested.apply(UiAction::Left, 1, true));
    CHECK(nested.page() == 9);
    CHECK(nested.parentPage() == UiController::kRootPage);
    CHECK(nested.apply(UiAction::Back, 1, true));
    CHECK(nested.isRoot());
}

void testPhysicalButtonFrontendDebouncesAndMapsEveryKey() {
    Pcf8574ButtonInput input;
    input.reset(0xFF, 100);
    CHECK(Pcf8574ButtonInput::kPollPeriodMs == 5);
    CHECK(Pcf8574ButtonInput::kDebounceMs == 12);
    CHECK(Pcf8574ButtonInput::kButtonMask == 0xF8);

