anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    const auto bleUnavailable = decideSourceDegradation(
        wifi | ble, 0, RadioKind::Ble, SourceFailureClass::Unavailable);
    CHECK(bleUnavailable.valid);
    CHECK(bleUnavailable.continueSession);
    CHECK(bleUnavailable.activeSourceMask == wifi);
    CHECK(bleUnavailable.unavailableSourceMask == ble);
    CHECK(bleUnavailable.windowState == SourceWindowState::Unavailable);
    CHECK(bleUnavailable.windowReason == SourceWindowReason::DriverUnavailable);
    CHECK(std::strcmp(bleUnavailable.status, "source_degraded") == 0);

    const auto wifiFault = decideSourceDegradation(
        wifi, ble, RadioKind::Wifi, SourceFailureClass::Fault);
    CHECK(wifiFault.valid);
    CHECK(!wifiFault.continueSession);
    CHECK(wifiFault.activeSourceMask == 0);
    CHECK(wifiFault.unavailableSourceMask == (wifi | ble));
    CHECK(wifiFault.windowState == SourceWindowState::Fault);
    CHECK(wifiFault.windowReason == SourceWindowReason::DriverFault);
    CHECK(std::strcmp(wifiFault.status, "all_sources_failed") == 0);

    const auto duplicateFailure = decideSourceDegradation(
        wifi, ble, RadioKind::Ble, SourceFailureClass::Unavailable);
    CHECK(!duplicateFailure.valid);
    CHECK(!duplicateFailure.continueSession);
}

void testSourceTimelineStreamsHonestDutyWindowsAndDrops() {
    SourceTimeline timeline;
    const std::uint8_t wifi = sourceMask(RadioKind::Wifi);
    const std::uint8_t ble = sourceMask(RadioKind::Ble);
    CHECK(kSupportedSourceMask == (wifi | ble));
    CHECK(timeline.start(0, 100) == SourceTimelineStatus::InvalidMask);
    CHECK(timeline.start(static_cast<std::uint8_t>(1U << 7U), 100) ==
          SourceTimelineStatus::InvalidMask);
    CHECK(timeline.start(wifi | ble, 100) == SourceTimelineStatus::Started);
    CHECK(timeline.state() == SourceTimelineState::Running);
    CHECK(timeline.selectedMask() == (wifi | ble));
    CHECK(timeline.source(RadioKind::Wifi) != nullptr &&
          timeline.source(RadioKind::Wifi)->state ==
              SourceWindowState::Scheduled);
    CHECK(timeline.recordObservation(RadioKind::Wifi, true, 105) ==
          SourceTimelineStatus::InvalidState);
    CHECK(timeline.transition(RadioKind::Wifi, SourceWindowState::Active,
                              SourceWindowReason::DutyCycle, 110) ==
          SourceTimelineStatus::InvalidReason);

    CHECK(timeline.transition(RadioKind::Wifi, SourceWindowState::Active,
                              SourceWindowReason::None, 110) ==
          SourceTimelineStatus::Transitioned);
    CHECK(timeline.recordObservation(RadioKind::Wifi, true, 120) ==
          SourceTimelineStatus::ObservationRecorded);
    CHECK(timeline.recordObservation(RadioKind::Wifi, false, 125) ==
          SourceTimelineStatus::ObservationRecorded);
    CHECK(timeline.transition(RadioKind::Ble,
                              SourceWindowState::Unavailable,
                              SourceWindowReason::DriverUnavailable, 130) ==
          SourceTimelineStatus::Transitioned);
    CHECK(timeline.transition(RadioKind::Wifi, SourceWindowState::Scheduled,
                              SourceWindowReason::DutyCycle, 140) ==
          SourceTimelineStatus::Transitioned);
    CHECK(timeline.transition(RadioKind::Ble, SourceWindowState::Active,
                              SourceWindowReason::None, 150) ==
          SourceTimelineStatus::Transitioned);
    CHECK(timeline.recordObservation(RadioKind::Ble, true, 160) ==
          SourceTimelineStatus::ObservationRecorded);
    CHECK(timeline.transition(RadioKind::Wifi, SourceWindowState::Active,
                              SourceWindowReason::None, 159) ==
          SourceTimelineStatus::OutOfOrder);
    CHECK(timeline.stop(200) == SourceTimelineStatus::Stopped);
    CHECK(timeline.state() == SourceTimelineState::Stopped);
    CHECK(timeline.queuedWindows() == 6);
    CHECK(timeline.windowHighWater() == 6);
    CHECK(timeline.overflowEvents() == 0);

    const SourceRuntimeSummary* wifiSummary = timeline.source(RadioKind::Wifi);
    const SourceRuntimeSummary* bleSummary = timeline.source(RadioKind::Ble);
    CHECK(wifiSummary != nullptr && wifiSummary->scheduledUs == 70);
    CHECK(wifiSummary != nullptr && wifiSummary->activeUs == 30);
    CHECK(wifiSummary != nullptr && wifiSummary->accepted == 1);
    CHECK(wifiSummary != nullptr && wifiSummary->dropped == 1);
    CHECK(wifiSummary != nullptr && wifiSummary->windows == 3);
    CHECK(wifiSummary != nullptr && wifiSummary->transitions == 2);
    CHECK(bleSummary != nullptr && bleSummary->scheduledUs == 30);
    CHECK(bleSummary != nullptr && bleSummary->unavailableUs == 20);
    CHECK(bleSummary != nullptr && bleSummary->activeUs == 50);
    CHECK(bleSummary != nullptr && bleSummary->accepted == 1);
    CHECK(bleSummary != nullptr && bleSummary->dropped == 0);
    CHECK(timeline.dutyPermille(RadioKind::Wifi, 200) == 300);
    CHECK(timeline.dutyPermille(RadioKind::Ble, 200) == 500);

    static constexpr std::array<RadioKind, 6> kExpectedSources{{
        RadioKind::Wifi, RadioKind::Ble, RadioKind::Wifi,
        RadioKind::Ble, RadioKind::Wifi, RadioKind::Ble,
    }};
    static constexpr std::array<SourceWindowState, 6> kExpectedStates{{
        SourceWindowState::Scheduled, SourceWindowState::Scheduled,
        SourceWindowState::Active, SourceWindowState::Unavailable,
        SourceWindowState::Scheduled, SourceWindowState::Active,
    }};
    for (std::size_t index = 0; index < kExpectedSources.size(); ++index) {
        SourceWindow window;
        CHECK(timeline.pop(&window) ==
              SourceTimelineStatus::WindowDequeued);
        CHECK(window.source == kExpectedSources[index]);
        CHECK(window.state == kExpectedStates[index]);
        CHECK(window.endedUs >= window.startedUs);
    }
    SourceWindow empty;
    CHECK(timeline.pop(&empty) == SourceTimelineStatus::Empty);
    CHECK(std::strcmp(sourceWindowStateName(SourceWindowState::Unavailable),
                      "unavailable") == 0);
    CHECK(std::strcmp(sourceWindowReasonName(
                          SourceWindowReason::DriverUnavailable),
                      "driver_unavailable") == 0);
    CHECK(std::strcmp(sourceTimelineStateName(SourceTimelineState::Stopped),
                      "stopped") == 0);
    CHECK(std::strcmp(sourceTimelineStatusName(SourceTimelineStatus::Full),
                      "full") == 0);
}

