anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    char summary[768] = {};
    CHECK(formatSessionJsonSummary(reopened, summary, sizeof(summary)));
    CHECK(std::strstr(summary, "leshy.session.summary.v2") != nullptr);
    CHECK(std::strstr(summary, "\"windows\":5") != nullptr);
    CHECK(std::strstr(summary, "\"duty_permille\":800") != nullptr);

    LibraryController library;
    CHECK(library.add(reopened, 73, SessionIntegrity::Valid, true, false));
    CHECK(library.openSelected());
    CHECK(library.requestExport());
    char artifact[4096] = {};
    const LibraryExportResult exported =
        library.formatSelectedJsonExport(artifact, sizeof(artifact));
    CHECK(exported.valid());
    CHECK(std::strstr(artifact, "leshy.library.export.v1") != nullptr);
    CHECK(std::strstr(artifact, "leshy.session.summary.v2") != nullptr);
    CHECK(std::strstr(artifact, "\"windows\":5") != nullptr);
    CHECK(std::strstr(artifact, "\"retained\":5") != nullptr);
    CHECK(std::strstr(artifact, "\"timeline_windows\":[") != nullptr);
    CHECK(std::strstr(artifact, "\"source\":\"ble\"") != nullptr);
    CHECK(std::strstr(artifact, "\"reason\":\"driver_unavailable\"") != nullptr);

    for (std::size_t index = 0; index < segmentSize; ++index) {
        segment[index] ^= 1U;
        CHECK(reopenSession(manifest.data(), manifestSize, segment.data(),
                            segmentSize, &reopened) != SessionCodecStatus::Valid);
        segment[index] ^= 1U;
    }

    SurveySession bounded;
    CHECK(bounded.start("timeline-ring", 1000) == SessionStatus::Started);
    CHECK(bounded.startTimeline(wifiMask, 1000) ==
          SessionTimelineStatus::Started);
    for (std::size_t index = 0; index < 20; ++index) {
        const SourceWindow window{
            RadioKind::Wifi, SourceWindowState::Scheduled,
            SourceWindowReason::DutyCycle, 1000 + index * 10,
            1010 + index * 10, 0, 0};
        CHECK(bounded.appendTimelineWindow(window) ==
              SessionTimelineStatus::Appended);
    }
    wifi = {};
    wifi.selected = true;
    wifi.state = SourceWindowState::Stopped;
    wifi.scheduledUs = 200;
    wifi.windows = 20;
    wifi.transitions = 19;
    ble = {};
    CHECK(bounded.finalizeTimeline(1200, wifi, ble, 0) ==
          SessionTimelineStatus::Finalized);
    CHECK(bounded.stop(1200) == SessionStatus::Stopped);
    CHECK(bounded.timeline().totalWindows == 20);
    CHECK(bounded.timeline().evictedWindows == 4);
    CHECK(bounded.timelineWindowCount() == 16);
    CHECK(bounded.timelineWindow(0) != nullptr &&
          bounded.timelineWindow(0)->startedUs == 1040);
}

SurveySession stoppedSessionWithId(const char* id, std::uint64_t stoppedUs) {
    SurveySession session;
    CHECK(session.start(id, 1000) == SessionStatus::Started);
    static constexpr std::array<std::array<std::uint8_t, 6>, 3> kBssids{{
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x01},
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x02},
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x03},
    }};
    static constexpr std::array<std::uint8_t, 3> kChannels{{1, 6, 11}};
    static constexpr std::array<std::int16_t, 3> kRssi{{-71, -55, -83}};
    static constexpr std::array<const char*, 3> kSsids{{"alpha", "bravo", "charlie"}};
    for (std::size_t index = 0; index < kBssids.size(); ++index) {
        WifiScanRecord record;
        record.bssid = kBssids[index];
        record.channel = kChannels[index];
        record.rssiDbm = kRssi[index];
        record.ssid = kSsids[index];
        record.ssidLength = std::strlen(kSsids[index]);
        Observation observation;
        CHECK(normalizePassiveRecord(record, 2000 + index, &observation));
        CHECK(session.append(observation) == SessionStatus::Appended);
    }
    CHECK(session.stop(stoppedUs) == SessionStatus::Stopped);
    return session;
}

SurveySession goldenStoppedSession() {
    return stoppedSessionWithId("golden-wifi-001", 3000);
}

void testOfflineLibraryControllerIsBoundedAndPreservesProvenance() {
    LibraryController library;
    CHECK(library.size() == 0);
    CHECK(library.view() == LibraryView::SessionList);
    CHECK(!library.openSelected());

    const SurveySession first = goldenStoppedSession();
    const SurveySession second = stoppedSessionWithId("golden-wifi-002", 4000);
    CHECK(library.add(first, 1, SessionIntegrity::RecoveredFallback, false, true));
    CHECK(!library.add(first, 1, SessionIntegrity::Valid, false, true));
    CHECK(library.add(second, 2, SessionIntegrity::Valid, false, true));
    CHECK(library.size() == 2);
    CHECK(library.selected() != nullptr);
    CHECK(library.selected()->generation == 1);
    CHECK(library.selected()->simulated);
    CHECK(!library.selected()->persistent);
    CHECK(library.selected()->integrity == SessionIntegrity::RecoveredFallback);
    CHECK(library.next());
    CHECK(library.selection() == 1);
    CHECK(!library.next());
    CHECK(library.openSelected());
    CHECK(library.view() == LibraryView::SessionDetail);
    CHECK(!library.previous());
    CHECK(library.requestExport());
    CHECK(library.view() == LibraryView::ExportReady);
    char exported[640] = {};
    const LibraryExportResult exportResult =
        library.formatSelectedJsonExport(exported, sizeof(exported));
    CHECK(exportResult.valid());
    CHECK(exportResult.bytes == std::strlen(exported));
    CHECK(std::strcmp(
              exported,
              "{\"schema\":\"leshy.library.export.v1\",\"kind\":\"artifact\","
              "\"status\":\"valid\",\"generation\":2,\"integrity\":\"valid\","
              "\"simulated\":true,\"persistent\":false,"
              "\"transport\":\"serial_ndjson\",\"storage_backend\":\"bounded_ram\","
              "\"radio_touched\":false,\"session\":{"
              "\"schema\":\"leshy.session.summary.v1\",\"id\":\"golden-wifi-002\","
              "\"started_us\":1000,\"stopped_us\":4000,\"observations\":3,"
              "\"dropped\":0,\"sources\":{\"wifi\":3}}}") == 0);
    char exportTooSmall[32] = {};
    CHECK(library.formatSelectedJsonExport(exportTooSmall, sizeof(exportTooSmall)).status ==
          LibraryExportStatus::BufferTooSmall);
    CHECK(exportTooSmall[0] == '\0');
    CHECK(library.back());
    CHECK(library.view() == LibraryView::SessionDetail);
    CHECK(library.back());
    CHECK(library.view() == LibraryView::SessionList);
    CHECK(library.previous());
    CHECK(library.selection() == 0);
    CHECK(std::strcmp(sessionIntegrityName(SessionIntegrity::Valid), "valid") == 0);

    SurveySession running;
    CHECK(running.start("running", 1) == SessionStatus::Started);
    CHECK(!library.add(running, 3, SessionIntegrity::Valid, false, true));
    library.clear();
    CHECK(library.size() == 0);
    CHECK(library.selection() == 0);
    CHECK(library.view() == LibraryView::SessionList);
    CHECK(!library.requestExport());
    CHECK(library.formatSelectedJsonExport(exported, sizeof(exported)).status ==
          LibraryExportStatus::SessionUnavailable);
    CHECK(std::strcmp(libraryExportStatusName(LibraryExportStatus::Valid), "valid") == 0);
}

