anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
void testSessionCatalogRecoversReadOnlyAndMarksFallbackIntegrity() {
    leshy1::platform::arduino::RamSessionStoreIo io;
    SessionStoreWorkspace workspace;
    SessionCatalog catalog;
    LibraryController library;
    SurveySession recovered;

    io.reset();
    SessionCatalogResult result = catalog.recoverLatest(
        io, workspace, recovered, library, true, false);
    CHECK(result.status == SessionCatalogStatus::Empty);
    CHECK(result.storeStatus == SessionStoreStatus::Empty);
    CHECK(library.size() == 0);

    const SurveySession first = stoppedSessionWithId("catalog-first", 3000);
    const SurveySession second = stoppedSessionWithId("catalog-second", 4000);
    CHECK(commitNextSession(io, workspace, first).complete());
    CHECK(commitNextSession(io, workspace, second).complete());
    const std::size_t fileSyncs = io.fileSyncs();
    const std::size_t directorySyncs = io.directorySyncs();
    CHECK(io.flipSegmentByte(2, 0));
    result = catalog.recoverLatest(io, workspace, recovered, library, true,
                                   false);
    CHECK(result.admitted());
    CHECK(result.generation == 1);
    CHECK(result.observations == 3);
    CHECK(result.integrity == SessionIntegrity::RecoveredFallback);
    CHECK(library.size() == 1);
    CHECK(library.selected() != nullptr && library.selected()->persistent);
    CHECK(library.selected() != nullptr && !library.selected()->simulated);
    CHECK(library.selected() != nullptr && library.selected()->integrity ==
                                              SessionIntegrity::RecoveredFallback);
    CHECK(library.selected() != nullptr && library.selected()->session != nullptr &&
          std::strcmp(library.selected()->session->id(), "catalog-first") == 0);
    CHECK(io.fileSyncs() == fileSyncs);
    CHECK(io.directorySyncs() == directorySyncs);
    CHECK(std::strcmp(sessionCatalogStatusName(result.status), "admitted") == 0);

    result = catalog.recoverLatest(io, workspace, recovered, library, true,
                                   false);
    CHECK(result.status == SessionCatalogStatus::Admitted);
    CHECK(library.size() == 1);

    const SessionStoreRecoveryResult duplicateRecovery =
        recoverSession(io, workspace, &workspace.validationSession);
    CHECK(duplicateRecovery.valid());
    result = catalog.admitRecovered(workspace.validationSession,
                                    duplicateRecovery, library, true, false);
    CHECK(result.status == SessionCatalogStatus::AdmissionRejected);
    CHECK(library.size() == 1);
}

void testSessionCodecCommitsCanonicalDataAndReopensOffline() {
    const SurveySession original = goldenStoppedSession();
    std::array<std::uint8_t, kSessionSegmentMaxBytes> segment{};
    std::array<std::uint8_t, kSessionManifestMaxBytes> manifest{};
    std::size_t segmentSize = 0;
    std::size_t manifestSize = 0;
    CHECK(encodeObservationSegment(original, segment.data(), segment.size(), &segmentSize) ==
          SessionCodecStatus::Valid);
    CHECK(encodeSessionManifest(original, segment.data(), segmentSize, manifest.data(),
                                manifest.size(), &manifestSize) == SessionCodecStatus::Valid);
    CHECK(manifestSize == 41);
    CHECK(crc32c(manifest.data(), manifestSize) == 0x5C35401EU);
    CHECK(segmentSize == 155);
    CHECK(crc32c(segment.data(), segmentSize) == 0x6A421EA4U);

    SessionManifest decodedManifest;
    CHECK(decodeSessionManifest(manifest.data(), manifestSize, &decodedManifest) ==
          SessionCodecStatus::Valid);
    CHECK(std::strcmp(decodedManifest.sessionId.data(), "golden-wifi-001") == 0);
    CHECK(decodedManifest.observationCount == 3);
    CHECK(decodedManifest.segmentLength == segmentSize);
    CHECK(decodedManifest.segmentCrc32c == crc32c(segment.data(), segmentSize));

    SurveySession reopened;
    CHECK(reopenSession(manifest.data(), manifestSize, segment.data(), segmentSize, &reopened) ==
          SessionCodecStatus::Valid);
    CHECK(reopened.state() == SessionState::Stopped);
    CHECK(reopened.size() == original.size());
    CHECK(std::strcmp(reopened.id(), original.id()) == 0);
    for (std::size_t index = 0; index < original.size(); ++index) {
        const Observation* expected = original.get(index);
        const Observation* actual = reopened.get(index);
        CHECK(expected != nullptr && actual != nullptr);
        if (expected != nullptr && actual != nullptr) {
            CHECK(actual->sequence == expected->sequence);
            CHECK(actual->monotonicUs == expected->monotonicUs);
            CHECK(actual->frequencyKhz == expected->frequencyKhz);
            CHECK(actual->channel == expected->channel);
            CHECK(actual->rssiDbm == expected->rssiDbm);
            CHECK(actual->identity == expected->identity);
            CHECK(std::strcmp(actual->label.data(), expected->label.data()) == 0);
        }
    }

    char summary[256] = {};
    CHECK(formatSessionJsonSummary(reopened, summary, sizeof(summary)));
    CHECK(std::strcmp(summary,
                      "{\"schema\":\"leshy.session.summary.v1\","
                      "\"id\":\"golden-wifi-001\",\"started_us\":1000,"
                      "\"stopped_us\":3000,\"observations\":3,\"dropped\":0,"
                      "\"sources\":{\"wifi\":3}}") == 0);
    char tooSmall[16] = {};
    CHECK(!formatSessionJsonSummary(reopened, tooSmall, sizeof(tooSmall)));

    HeadRecord head{1, static_cast<std::uint32_t>(manifestSize),
                    crc32c(manifest.data(), manifestSize)};
    std::uint8_t headWire[kHeadWireSize] = {};
    CHECK(encodeHead(head, headWire, sizeof(headWire)));
    const RecoveryResult recovery =
        recoverHead({headWire, sizeof(headWire),
                     {true, static_cast<std::uint32_t>(manifestSize),
                      crc32c(manifest.data(), manifestSize)}},
                    {});
    CHECK(recovery.choice == RecoveryChoice::A);

    for (std::size_t byte = 0; byte < manifestSize; ++byte) {
        for (std::uint8_t bit = 0; bit < 8; ++bit) {
            manifest[byte] ^= static_cast<std::uint8_t>(1U << bit);
            const RecoveryResult corrupted =
                recoverHead({headWire, sizeof(headWire),
                             {true, static_cast<std::uint32_t>(manifestSize),
                              crc32c(manifest.data(), manifestSize)}},
                            {});
            CHECK(corrupted.choice == RecoveryChoice::None);
            manifest[byte] ^= static_cast<std::uint8_t>(1U << bit);
        }
    }

    for (std::size_t size = 0; size < segmentSize; ++size) {
        CHECK(reopenSession(manifest.data(), manifestSize, segment.data(), size, &reopened) !=
              SessionCodecStatus::Valid);
    }
    for (std::size_t index = 0; index < segmentSize; ++index) {
        segment[index] ^= 1U;
        CHECK(reopenSession(manifest.data(), manifestSize, segment.data(), segmentSize,
                            &reopened) != SessionCodecStatus::Valid);
        segment[index] ^= 1U;
    }

    std::array<std::uint8_t, kSessionManifestMaxBytes> futureManifest = manifest;
    CHECK(manifestSize > 2);
    futureManifest[2] = kWifiFrameSessionSchemaVersion + 1U;
    CHECK(decodeSessionManifest(futureManifest.data(), manifestSize, &decodedManifest) ==
          SessionCodecStatus::UnsupportedSchema);
    futureManifest = manifest;
    futureManifest[manifestSize] = 0;
    CHECK(decodeSessionManifest(futureManifest.data(), manifestSize + 1, &decodedManifest) ==
          SessionCodecStatus::TrailingData);

    std::size_t ignored = 0;
    CHECK(encodeObservationSegment(original, segment.data(), 8, &ignored) ==
          SessionCodecStatus::BufferTooSmall);
    CHECK(encodeSessionManifest(original, segment.data(), segmentSize, manifest.data(), 8,
                                &ignored) == SessionCodecStatus::BufferTooSmall);
    CHECK(std::strcmp(sessionCodecStatusName(SessionCodecStatus::ChecksumMismatch),
                      "checksum_mismatch") == 0);
}

