anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
void testSessionCodecRoundTripsBleWithoutInventingWifiFields() {
    SurveySession original;
    CHECK(original.start("ble-codec", 1000) == SessionStatus::Started);
    Observation advertisement;
    advertisement.monotonicUs = 2000;
    advertisement.radio = RadioKind::Ble;
    advertisement.frequencyKhz = 0;
    advertisement.channel = 0;
    advertisement.rssiDbm = -61;
    advertisement.identity = {1, 2, 3, 4, 5, 6};
    advertisement.identityLength = 6;
    std::memcpy(advertisement.label.data(), "field-tag", 10);
    advertisement.labelLength = 9;
    CHECK(original.append(advertisement) == SessionStatus::Appended);
    CHECK(original.stop(3000) == SessionStatus::Stopped);

    std::array<std::uint8_t, kSessionSegmentMaxBytes> segment{};
    std::array<std::uint8_t, kSessionManifestMaxBytes> manifest{};
    std::size_t segmentSize = 0;
    std::size_t manifestSize = 0;
    CHECK(encodeObservationSegment(original, segment.data(), segment.size(),
                                   &segmentSize) == SessionCodecStatus::Valid);
    CHECK(encodeSessionManifest(original, segment.data(), segmentSize,
                                manifest.data(), manifest.size(),
                                &manifestSize) == SessionCodecStatus::Valid);

    SurveySession reopened;
    CHECK(reopenSession(manifest.data(), manifestSize, segment.data(),
                        segmentSize, &reopened) == SessionCodecStatus::Valid);
    CHECK(reopened.size() == 1);
    const Observation* restored = reopened.get(0);
    CHECK(restored != nullptr && restored->radio == RadioKind::Ble);
    CHECK(restored != nullptr && restored->frequencyKhz == 0);
    CHECK(restored != nullptr && restored->channel == 0);
    CHECK(restored != nullptr && restored->identity == advertisement.identity);
    CHECK(restored != nullptr &&
          std::strcmp(restored->label.data(), "field-tag") == 0);
}

void testCaptureMetadataV3AndCsvExportAreCanonical() {
    const std::uint8_t wifiMask = sourceMask(RadioKind::Wifi);
    const std::uint8_t bleMask = sourceMask(RadioKind::Ble);
    SurveySession original;
    CHECK(original.start("capture-v3", 1000) == SessionStatus::Started);
    CaptureMetadata metadata;
    metadata.present = true;
    metadata.passive = true;
    metadata.wifiShowHidden = true;
    metadata.selectedSourceMask = wifiMask | bleMask;
    metadata.wifiMaxMsPerChannel = 120;
    metadata.wifiChannel = 0;
    metadata.bleDurationMs = 2000;
    metadata.bleIntervalMs = 100;
    metadata.bleWindowMs = 90;
    metadata.bleMaximumRecords = 64;
    metadata.appIdentityLength = metadata.appIdentity.size();
    for (std::size_t index = 0; index < metadata.appIdentity.size(); ++index) {
        metadata.appIdentity[index] = static_cast<std::uint8_t>(index + 1U);
    }
    CHECK(original.configureCaptureMetadata(metadata) ==
          CaptureMetadataStatus::Configured);
    CHECK(original.configureCaptureMetadata(metadata) ==
          CaptureMetadataStatus::AlreadyConfigured);
    CHECK(original.startTimeline(wifiMask | bleMask, 1000) ==
          SessionTimelineStatus::Started);

    Observation wifi;
    wifi.monotonicUs = 1200;
    wifi.radio = RadioKind::Wifi;
    wifi.frequencyKhz = 2437000;
    wifi.channel = 6;
    wifi.rssiDbm = -51;
    wifi.identity = {1, 2, 3, 4, 5, 6};
    wifi.identityLength = 6;
    std::memcpy(wifi.label.data(), "alpha", 6);
    wifi.labelLength = 5;
    CHECK(original.append(wifi) == SessionStatus::Appended);
    Observation ble;
    ble.monotonicUs = 1300;
    ble.radio = RadioKind::Ble;
    ble.rssiDbm = -70;
    ble.identity = {10, 11, 12, 13, 14, 15};
    ble.identityLength = 6;
    std::memcpy(ble.label.data(), "beacon", 7);
    ble.labelLength = 6;
    CHECK(original.append(ble) == SessionStatus::Appended);

    static constexpr std::array<SourceWindow, 5> kWindows{{
        {RadioKind::Wifi, SourceWindowState::Scheduled,
         SourceWindowReason::DutyCycle, 1000, 1100, 0, 0},
        {RadioKind::Wifi, SourceWindowState::Active,
         SourceWindowReason::None, 1100, 1400, 1, 0},
        {RadioKind::Ble, SourceWindowState::Scheduled,
         SourceWindowReason::DutyCycle, 1000, 1400, 0, 0},
        {RadioKind::Wifi, SourceWindowState::Scheduled,
         SourceWindowReason::DutyCycle, 1400, 1600, 0, 0},
        {RadioKind::Ble, SourceWindowState::Active,
         SourceWindowReason::None, 1400, 1600, 1, 0},
    }};
    for (const SourceWindow& window : kWindows) {
        CHECK(original.appendTimelineWindow(window) ==
              SessionTimelineStatus::Appended);
    }
    SourceRuntimeSummary wifiSummary;
    wifiSummary.selected = true;
    wifiSummary.state = SourceWindowState::Stopped;
    wifiSummary.scheduledUs = 300;
    wifiSummary.activeUs = 300;
    wifiSummary.accepted = 1;
    wifiSummary.windows = 3;
    wifiSummary.transitions = 2;
    SourceRuntimeSummary bleSummary;
    bleSummary.selected = true;
    bleSummary.state = SourceWindowState::Stopped;
    bleSummary.scheduledUs = 400;
    bleSummary.activeUs = 200;
    bleSummary.accepted = 1;
    bleSummary.windows = 2;
    bleSummary.transitions = 1;
    CHECK(original.finalizeTimeline(1600, wifiSummary, bleSummary, 0) ==
          SessionTimelineStatus::Finalized);
    CHECK(original.stop(1700) == SessionStatus::Stopped);

    std::array<std::uint8_t, kSessionSegmentMaxBytes> segment{};
    std::array<std::uint8_t, kSessionManifestMaxBytes> manifest{};
    std::size_t segmentSize = 0;
    std::size_t manifestSize = 0;
    CHECK(encodeObservationSegment(original, segment.data(), segment.size(),
                                   &segmentSize) == SessionCodecStatus::Valid);
    CHECK(encodeSessionManifest(original, segment.data(), segmentSize,
                                manifest.data(), manifest.size(),
                                &manifestSize) == SessionCodecStatus::Valid);
    SessionManifest decodedManifest;
    CHECK(decodeSessionManifest(manifest.data(), manifestSize,
                                &decodedManifest) == SessionCodecStatus::Valid);
    CHECK(decodedManifest.schemaVersion == kSessionSchemaVersion);

