anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    SurveySession reopened;
    CHECK(reopenSession(manifest.data(), manifestSize, segment.data(),
                        segmentSize, &reopened) == SessionCodecStatus::Valid);
    CHECK(reopened.captureMetadata().present);
    CHECK(reopened.captureMetadata().selectedSourceMask == (wifiMask | bleMask));
    CHECK(reopened.captureMetadata().wifiShowHidden);
    CHECK(reopened.captureMetadata().wifiMaxMsPerChannel == 120);
    CHECK(reopened.captureMetadata().bleDurationMs == 2000);
    CHECK(reopened.captureMetadata().bleIntervalMs == 100);
    CHECK(reopened.captureMetadata().bleWindowMs == 90);
    CHECK(reopened.captureMetadata().bleMaximumRecords == 64);
    CHECK(reopened.captureMetadata().appIdentity == metadata.appIdentity);
    CHECK(!reopened.captureMetadata().framePayloadCaptured);
    CHECK(reopened.captureMetadata().framePayloadBytes == 0);

    LibraryController library;
    CHECK(library.add(reopened, 82, SessionIntegrity::Valid, true, false));
    CHECK(library.openSelected());
    CHECK(library.requestExport());
    char capture[1600] = {};
    CHECK(library.formatSelectedCaptureMetadata(
              capture, sizeof(capture)).valid());
    CHECK(std::strstr(capture, "leshy.capture.metadata.v1") != nullptr);
    CHECK(std::strstr(capture, "\"immutable\":true") != nullptr);
    CHECK(std::strstr(capture, "\"wifi\":1,\"ble\":1") != nullptr);
    CHECK(std::strstr(capture, "0102030405060708090a0b0c0d0e0f10") != nullptr);
    CHECK(std::strstr(capture, "\"csv_observations\":\"available\"") != nullptr);
    CHECK(std::strstr(capture, "\"pcap\":\"unavailable_no_frame_payload\"") != nullptr);

    char csv[256] = {};
    const auto header = library.formatSelectedCsvHeader(csv, sizeof(csv));
    CHECK(header.valid());
    CHECK(std::strcmp(
              csv,
              "session_id,sequence,monotonic_us,radio,frequency_khz,channel,"
              "rssi_dbm,identity_hex,label_hex\r\n") == 0);
    CHECK(library.formatSelectedCsvRow(0, csv, sizeof(csv)).valid());
    CHECK(std::strcmp(csv,
                      "capture-v3,1,1200,wifi,2437000,6,-51,"
                      "010203040506,616c706861\r\n") == 0);
    CHECK(library.formatSelectedCsvRow(1, csv, sizeof(csv)).valid());
    CHECK(std::strcmp(csv,
                      "capture-v3,2,1300,ble,0,0,-70,"
                      "0a0b0c0d0e0f,626561636f6e\r\n") == 0);
    CHECK(library.formatSelectedCsvRow(2, csv, sizeof(csv)).status ==
          LibraryExportStatus::RecordOutOfRange);
    CHECK(library.formatSelectedPcapStatus(csv, sizeof(csv)).valid());
    CHECK(std::strstr(csv, "unavailable_no_frame_payload") != nullptr);

    CaptureMetadata invalid = metadata;
    invalid.framePayloadCaptured = true;
    invalid.framePayloadBytes = 1;
    SurveySession rejected;
    CHECK(rejected.start("capture-invalid", 1) == SessionStatus::Started);
    CHECK(rejected.configureCaptureMetadata(invalid) ==
          CaptureMetadataStatus::InvalidMetadata);
    CHECK(std::strcmp(captureMetadataStatusName(
                          CaptureMetadataStatus::Configured),
                      "configured") == 0);
}

struct PcapMemorySink final {
    std::vector<std::uint8_t> bytes;
};

bool appendPcapBytes(const std::uint8_t* data, std::size_t size, void* context) {
    auto* sink = static_cast<PcapMemorySink*>(context);
    if (sink == nullptr || (data == nullptr && size != 0U)) return false;
    sink->bytes.insert(sink->bytes.end(), data, data + size);
    return true;
}

void testWifiFrameCaptureExportsByteExactRadiotapPcap() {
    WifiFrameCapture capture;
    WifiFrameCapturePlan invalid;
    invalid.channel = 14;
    CHECK(!capture.begin(invalid, 1000000));

    WifiFrameCapturePlan plan;
    plan.channel = 0;
    plan.durationMs = 10000;
    plan.channelDwellMs = 120;
    plan.snapLength = 64;
    plan.maximumFrames = 2;
    CHECK(validateWifiFrameCapturePlan(plan));
    CHECK(capture.begin(plan, 1000000));
    CHECK(capture.stats().state == WifiFrameCaptureState::Running);

    std::array<std::uint8_t, 80> management{};
    for (std::size_t index = 0; index < management.size(); ++index) {
        management[index] = static_cast<std::uint8_t>(index);
    }
    const std::array<std::uint8_t, 4> control{{0xD4, 0x00, 0x00, 0x00}};
    CHECK(capture.append(management.data(), management.size(), 1500000, -42,
                         6, WifiFrameKind::Management, true));
    CHECK(capture.append(control.data(), control.size(), 1750000, -70, 1,
                         WifiFrameKind::Control, true));
    CHECK(!capture.append(control.data(), control.size(), 1800000, -71, 1,
                          WifiFrameKind::Control, true));
    CHECK(capture.stats().framesReported == 3);
    CHECK(capture.stats().framesAccepted == 2);
    CHECK(capture.stats().framesDroppedCapacity == 1);
    CHECK(capture.stats().framesDroppedInvalid == 0);
    CHECK(capture.stats().payloadBytes == 68);
    CHECK(capture.frame(0) != nullptr &&
          capture.frame(0)->capturedLength == 64);
    CHECK(capture.frame(0) != nullptr &&
          capture.frame(0)->originalLength == 80);
    CHECK(radiotapPcapSize(capture) == 0);
    CHECK(capture.complete(2000000));

    PcapMemorySink sink;
    const PcapExportResult result =
        writeRadiotapPcap(capture, appendPcapBytes, &sink);
    CHECK(result.valid);
    CHECK(result.framesWritten == 2);
    CHECK(result.bytesWritten == 154);
    CHECK(radiotapPcapSize(capture) == result.bytesWritten);
    CHECK(sink.bytes.size() == result.bytesWritten);
    CHECK(sink.bytes[0] == 0xD4 && sink.bytes[1] == 0xC3 &&
          sink.bytes[2] == 0xB2 && sink.bytes[3] == 0xA1);
    CHECK(sink.bytes[4] == 2 && sink.bytes[6] == 4);
    CHECK(sink.bytes[20] == 127 && sink.bytes[21] == 0);
    CHECK(sink.bytes[24] == 1 && sink.bytes[28] == 0x20 &&
          sink.bytes[29] == 0xA1 && sink.bytes[30] == 0x07);
    CHECK(sink.bytes[32] == 79 && sink.bytes[36] == 95);
    CHECK(sink.bytes[40] == 0 && sink.bytes[42] == 15);
    CHECK(sink.bytes[44] == 0x2A && sink.bytes[48] == 0x10);
    CHECK(sink.bytes[50] == 0x85 && sink.bytes[51] == 0x09);
    CHECK(sink.bytes[54] == static_cast<std::uint8_t>(-42));
    CHECK(sink.bytes[55] == 0 && sink.bytes[56] == 1);
    CHECK(std::strcmp(wifiFrameKindName(WifiFrameKind::Data), "data") == 0);
    CHECK(std::strcmp(wifiFrameCaptureStateName(capture.stats().state),
                      "complete") == 0);

