anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    std::vector<std::uint8_t>& newestManifest = io.files["manifest-00000002.bin"];
    CHECK(!newestManifest.empty());
    newestManifest[0] ^= 1U;
    recovered = recoverSession(io, workspace, &reopened);
    CHECK(recovered.valid());
    CHECK(recovered.generation == 1);
    CHECK(recovered.bStatus == CandidateStatus::ManifestMismatch);
    newestManifest[0] ^= 1U;

    io.failNextSync = true;
    committed = commitNextSession(io, workspace, generationTwo);
    CHECK(!committed.complete());
    CHECK(committed.status == SessionStoreStatus::SyncError);
    CHECK(committed.stage == CommitStage::SyncPayloads);
    recovered = recoverSession(io, workspace, &reopened);
    CHECK(recovered.valid());
    CHECK(recovered.generation == 2);

    SurveySession running;
    CHECK(running.start("running", 1) == SessionStatus::Started);
    CHECK(commitSession(io, workspace, running, 4, HeadSlot::A).status ==
          SessionStoreStatus::SessionNotStopped);
    CHECK(recoverSession(io, workspace, nullptr).status ==
          SessionStoreStatus::InvalidArgument);
    CHECK(std::strcmp(sessionStoreStatusName(SessionStoreStatus::CorruptGeneration),
                      "corrupt_generation") == 0);

    MemorySessionStoreIo rolloverIo;
    SessionStoreWorkspace rolloverWorkspace;
    CHECK(commitSession(rolloverIo, rolloverWorkspace, generationOne, UINT32_MAX,
                        HeadSlot::A).complete());
    committed = commitNextSession(rolloverIo, rolloverWorkspace, generationTwo);
    CHECK(committed.complete());
    CHECK(committed.generation == 0);
    CHECK(committed.publishedSlot == HeadSlot::B);
    recovered = recoverSession(rolloverIo, rolloverWorkspace, &reopened);
    CHECK(recovered.valid());
    CHECK(recovered.generation == 0);
    CHECK(std::strcmp(reopened.id(), "golden-wifi-002") == 0);

    MemorySessionStoreIo corruptIo;
    corruptIo.files["head-a.bin"] = std::vector<std::uint8_t>(kHeadWireSize, 0xA5);
    SessionStoreWorkspace corruptWorkspace;
    recovered = recoverSession(corruptIo, corruptWorkspace, &reopened);
    CHECK(recovered.status == SessionStoreStatus::NoGeneration);
    const std::size_t corruptFileCount = corruptIo.files.size();
    committed = commitNextSession(corruptIo, corruptWorkspace, generationOne);
    CHECK(committed.status == SessionStoreStatus::NoGeneration);
    CHECK(corruptIo.files.size() == corruptFileCount);

    MemorySessionStoreIo sustainedIo;
    SessionStoreWorkspace sustainedWorkspace;
    for (std::uint32_t generation = 1; generation <= 32; ++generation) {
        const SessionStoreCommitResult next =
            commitNextSession(sustainedIo, sustainedWorkspace, generationOne);
        CHECK(next.complete());
        CHECK(next.generation == generation);
    }
    recovered = recoverSession(sustainedIo, sustainedWorkspace, &reopened);
    CHECK(recovered.valid());
    CHECK(recovered.generation == 32);
    CHECK(sustainedIo.files["head-a.bin"].size() == kHeadWireSize);
    CHECK(sustainedIo.files["head-b.bin"].size() == kHeadWireSize);
    CHECK(sustainedIo.fileSyncs == 96);
    CHECK(sustainedIo.directorySyncs == 96);
}

struct BoundaryHookRecord final {
    std::size_t calls = 0;
    CommitStage stage = CommitStage::Complete;
};

void recordBoundaryHook(void* context, CommitStage stage) {
    auto* record = static_cast<BoundaryHookRecord*>(context);
    if (record == nullptr) return;
    ++record->calls;
    record->stage = stage;
}

void testSessionStoreBoundaryWrapperStopsAfterEachSuccessfulBoundary() {
    static constexpr std::array<CommitStage, 6> kBoundaries{{
        CommitStage::WritePayloads,
        CommitStage::SyncPayloads,
        CommitStage::WriteManifest,
        CommitStage::SyncManifest,
        CommitStage::WriteHead,
        CommitStage::SyncHead,
    }};
    const SurveySession generationOne = goldenStoppedSession();
    const SurveySession generationTwo = stoppedSessionWithId("reset-next", 4000);

    for (std::size_t index = 0; index < kBoundaries.size(); ++index) {
        MemorySessionStoreIo io;
        SessionStoreWorkspace workspace;
        CHECK(commitNextSession(io, workspace, generationOne).complete());
        const auto priorSegment = io.files["segment-00000001.bin"];
        const auto priorManifest = io.files["manifest-00000001.bin"];

        BoundaryHookRecord hook;
        SessionStoreBoundaryIo injecting(io, kBoundaries[index],
                                         recordBoundaryHook, &hook);
        const SessionStoreCommitResult interrupted =
            commitNextSession(injecting, workspace, generationTwo);
        CHECK(injecting.armed());
        CHECK(injecting.stopped());
        CHECK(injecting.sequenceValid());
        CHECK(injecting.boundariesReached() == index + 1);
        CHECK(injecting.lastReached() == kBoundaries[index]);
        CHECK(hook.calls == 1);
        CHECK(hook.stage == kBoundaries[index]);
        CHECK(!interrupted.complete());
        CHECK(interrupted.stage == kBoundaries[index]);

        SurveySession reopened;
        const SessionStoreRecoveryResult recovered =
            recoverSession(io, workspace, &reopened);
        CHECK(recovered.valid());
        const std::uint32_t expectedGeneration = index < 4 ? 1U : 2U;
        CHECK(recovered.generation == expectedGeneration);
        CHECK(recovered.observations == 3);
        CHECK(io.files["segment-00000001.bin"] == priorSegment);
        CHECK(io.files["manifest-00000001.bin"] == priorManifest);
        CHECK(std::strcmp(sessionStoreBoundaryName(kBoundaries[index]),
                          index == 0 ? "write_payloads" :
                          index == 1 ? "sync_payloads" :
                          index == 2 ? "write_manifest" :
                          index == 3 ? "sync_manifest" :
                          index == 4 ? "write_head" : "sync_head") == 0);
    }

    MemorySessionStoreIo passthroughIo;
    SessionStoreWorkspace passthroughWorkspace;
    SessionStoreBoundaryIo passthrough(passthroughIo, CommitStage::Complete);
    CHECK(!passthrough.armed());
    CHECK(commitNextSession(passthrough, passthroughWorkspace,
                            generationOne).complete());
    CHECK(!passthrough.stopped());
    CHECK(passthrough.sequenceValid());
    CHECK(passthrough.boundariesReached() == 6);
    CHECK(std::strcmp(sessionStoreBoundaryName(CommitStage::Complete),
                      "complete") == 0);
}

void testRamSessionStoreAdapterMatchesBoardFixtureContract() {
    leshy1::platform::arduino::RamSessionStoreIo io;
    io.reset();
    SessionStoreWorkspace workspace;
    const SurveySession session = goldenStoppedSession();
    CHECK(commitNextSession(io, workspace, session).complete());
    CHECK(commitNextSession(io, workspace, session).complete());
    SurveySession reopened;
    SessionStoreRecoveryResult recovered = recoverSession(io, workspace, &reopened);
    CHECK(recovered.valid());
    CHECK(recovered.generation == 2);
    CHECK(recovered.observations == 3);
    CHECK(io.fileSyncs() == 6);
    CHECK(io.directorySyncs() == 6);

    CHECK(io.flipSegmentByte(2, 0));
    recovered = recoverSession(io, workspace, &reopened);
    CHECK(recovered.valid());
    CHECK(recovered.generation == 1);
    CHECK(recovered.bStatus == CandidateStatus::InvalidPayload);
    CHECK(io.flipSegmentByte(2, 0));

