anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    HardwareInventory bleOnly;
    CHECK(bleOnly.add({"radio.wifi", CapabilityState::Fault, "builtin",
                       "wifi_fault"}));
    CHECK(bleOnly.add({"radio.ble", CapabilityState::Available, "builtin",
                       "ble_ready"}));
    controller.rebuild(bleOnly);
    CHECK(controller.selectedCount() == 1);
    CHECK(controller.selectedMask() == 2);
    CHECK(controller.find(SurveySourceKind::Wifi) != nullptr &&
          controller.find(SurveySourceKind::Wifi)->state ==
              SurveySourceState::Fault);
    CHECK(controller.find(SurveySourceKind::Ble) != nullptr &&
          controller.find(SurveySourceKind::Ble)->selected);
    CHECK(std::strcmp(surveySetupViewName(SurveySetupView::Sources),
                      "sources") == 0);
    CHECK(std::strcmp(surveySourceKindName(SurveySourceKind::Ble), "ble") == 0);
    CHECK(std::strcmp(surveySourceStateName(SurveySourceState::Conflicted),
                      "conflicted") == 0);

    HardwareInventory previewInventory;
    SurveySourceController preview;
    preview.rebuild(previewInventory, true);
    CHECK(preview.simulatedPreview());
    CHECK(preview.selectedCount() == 0);
    CHECK(preview.canStart());
    CHECK(preview.activate() == SurveySetupActivation::OpenedSources);
    CHECK(preview.back());
    CHECK(preview.next());
    CHECK(preview.activate() == SurveySetupActivation::OpenedSpectrum);
    CHECK(preview.next());
    CHECK(preview.activate() == SurveySetupActivation::StartRequested);
}

void testSurveyWorkflowCommitsOnceAndPreservesPriorLibraryOnFailure() {
    leshy1::platform::arduino::RamSessionStoreIo io;
    io.reset();
    SessionStoreWorkspace workspace;
    SurveySession active;
    SurveySession reopened;
    SurveyController controller(active);
    LibraryController library;
    SurveyWorkflow workflow(controller, io, workspace, reopened, library,
                            false, true);

    CHECK(workflow.state() == SurveyWorkflowState::Setup);
    CHECK(workflow.lastStatus() == SurveyWorkflowStatus::Ready);
    CHECK(workflow.configure(true, true) ==
          SurveyWorkflowStatus::InvalidState);
    CHECK(workflow.configure(false, true) == SurveyWorkflowStatus::Ready);
    CHECK(std::strcmp(surveyWorkflowStateName(workflow.state()), "setup") == 0);
    CHECK(workflow.cancel() == SurveyWorkflowStatus::Cancelled);
    CHECK(io.fileSyncs() == 0);
    CHECK(io.directorySyncs() == 0);
    CHECK(workflow.start("product-wifi-001", 1000) ==
          SurveyWorkflowStatus::Started);
    CHECK(workflow.state() == SurveyWorkflowState::Running);
    CHECK(workflow.start("duplicate", 1001) ==
          SurveyWorkflowStatus::InvalidState);

    const SurveySession golden = goldenStoppedSession();
    for (std::size_t index = 0; index < golden.size(); ++index) {
        const Observation* source = golden.get(index);
        CHECK(source != nullptr);
        if (source != nullptr) {
            CHECK(workflow.publish(*source) == SurveyWorkflowStatus::Appended);
        }
    }
    CHECK(controller.openSelected());
    CHECK(controller.back());
    CHECK(workflow.state() == SurveyWorkflowState::Running);
    CHECK(workflow.stopAndCommit(3000) == SurveyWorkflowStatus::Committed);
    CHECK(workflow.state() == SurveyWorkflowState::Result);
    CHECK(workflow.generation() == 1);
    CHECK(workflow.lastStoreStatus() == SessionStoreStatus::Valid);
    CHECK(!workflow.persistent());
    CHECK(workflow.simulated());
    CHECK(library.size() == 1);
    CHECK(library.selected() != nullptr);
    CHECK(library.selected() != nullptr && library.selected()->generation == 1);
    CHECK(library.selected() != nullptr && library.selected()->simulated);
    CHECK(library.selected() != nullptr && !library.selected()->persistent);
    CHECK(library.selected() != nullptr && library.selected()->session != nullptr &&
          std::strcmp(library.selected()->session->id(), "product-wifi-001") == 0);
    const std::size_t firstFileSyncs = io.fileSyncs();
    const std::size_t firstDirectorySyncs = io.directorySyncs();
    CHECK(workflow.stopAndCommit(3001) ==
          SurveyWorkflowStatus::AlreadyCommitted);
    CHECK(io.fileSyncs() == firstFileSyncs);
    CHECK(io.directorySyncs() == firstDirectorySyncs);

    CHECK(workflow.resetToSetup() == SurveyWorkflowStatus::Ready);
    CHECK(library.size() == 1);
    CHECK(workflow.start("product-wifi-002", 5000) ==
          SurveyWorkflowStatus::Started);
    Observation next = *golden.get(0);
    next.monotonicUs = 6000;
    CHECK(workflow.publish(next) == SurveyWorkflowStatus::Appended);
    CHECK(workflow.stopAndCommit(7000) == SurveyWorkflowStatus::Committed);
    CHECK(workflow.generation() == 2);
    CHECK(library.size() == 1);
    CHECK(library.selected() != nullptr && library.selected()->generation == 2);
    CHECK(library.selected() != nullptr && library.selected()->session != nullptr &&
          std::strcmp(library.selected()->session->id(), "product-wifi-002") == 0);

    CHECK(workflow.resetToSetup() == SurveyWorkflowStatus::Ready);
    CHECK(workflow.configure(true, false) == SurveyWorkflowStatus::Ready);
    CHECK(workflow.start("product-wifi-aborted", 7500) ==
          SurveyWorkflowStatus::Started);
    CHECK(workflow.configure(false, true) ==
          SurveyWorkflowStatus::InvalidState);
    CHECK(workflow.cancel() == SurveyWorkflowStatus::Cancelled);
    CHECK(workflow.state() == SurveyWorkflowState::Setup);
    CHECK(library.size() == 1);
    CHECK(library.selected() != nullptr && library.selected()->generation == 2);

    CHECK(workflow.configure(false, true) == SurveyWorkflowStatus::Ready);
    CHECK(workflow.start("product-wifi-003", 8000) ==
          SurveyWorkflowStatus::Started);
    next.monotonicUs = 9000;
    CHECK(workflow.publish(next) == SurveyWorkflowStatus::Appended);
    CHECK(workflow.stopAndCommit(10000) ==
          SurveyWorkflowStatus::StoreRejected);
    CHECK(workflow.state() == SurveyWorkflowState::Error);
    CHECK(workflow.lastStoreStatus() == SessionStoreStatus::IoError);
    CHECK(library.size() == 1);
    CHECK(library.selected() != nullptr && library.selected()->generation == 2);
    CHECK(library.selected() != nullptr && library.selected()->session != nullptr &&
          std::strcmp(library.selected()->session->id(), "product-wifi-002") == 0);
    CHECK(std::strcmp(surveyWorkflowStatusName(workflow.lastStatus()),
                      "store_rejected") == 0);
}

void testSessionStoreIoRouterSwitchesOnlyTheSelectedBackend() {
    leshy1::platform::arduino::RamSessionStoreIo first;
    leshy1::platform::arduino::RamSessionStoreIo second;
    first.reset();
    second.reset();
    leshy1::storage::SessionStoreIoRouter router(first);
    CHECK(router.boundTo(first));

    SessionStoreWorkspace workspace;
    const SurveySession source = goldenStoppedSession();
    CHECK(leshy1::storage::commitNextSession(router, workspace, source).complete());
    CHECK(first.fileSyncs() == 3);
    CHECK(second.fileSyncs() == 0);

