anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    CHECK(router.bind(second));
    CHECK(router.boundTo(second));
    CHECK(leshy1::storage::commitNextSession(router, workspace, source).complete());
    CHECK(first.fileSyncs() == 3);
    CHECK(second.fileSyncs() == 3);
}

void testSurveyPipelineQueuesDrainsDropsAndCommitsWithStopPolicy() {
    leshy1::platform::arduino::RamSessionStoreIo io;
    io.reset();
    SessionStoreWorkspace workspace;
    SurveySession active;
    SurveySession reopened;
    SurveyController controller(active);
    LibraryController library;
    SurveyWorkflow workflow(controller, io, workspace, reopened, library,
                            false, true);
    ObservationQueue queue;
    SurveyPipeline pipeline(workflow, queue);

    CHECK(pipeline.resetToSetup() == SurveyPipelineStatus::Ready);
    CHECK(pipeline.start("pipeline-first", 1000) ==
          SurveyPipelineStatus::Started);
    const SurveySession golden = goldenStoppedSession();
    for (std::size_t index = 0; index < golden.size(); ++index) {
        const Observation* source = golden.get(index);
        CHECK(source != nullptr);
        if (source != nullptr) {
            CHECK(pipeline.enqueue(*source) == SurveyPipelineStatus::Queued);
        }
    }
    SurveyPipelineProgress progress = pipeline.progress();
    CHECK(progress.received == 3);
    CHECK(progress.queued == 3);
    CHECK(progress.forwarded == 0);
    CHECK(progress.dropped == 0);
    CHECK(progress.queueDepth == 3);
    CHECK(progress.queueHighWater == 3);
    CHECK(progress.trigger == SessionBatchTrigger::None);
    CHECK(pipeline.drain(2) == SurveyPipelineStatus::Drained);
    progress = pipeline.progress();
    CHECK(progress.forwarded == 2);
    CHECK(progress.queueDepth == 1);
    CHECK(pipeline.drain(0) == SurveyPipelineStatus::InvalidState);
    CHECK(pipeline.drain(ObservationQueue::kCapacity) ==
          SurveyPipelineStatus::Drained);
    CHECK(pipeline.stopAndCommit(4000) == SurveyPipelineStatus::Committed);
    progress = pipeline.progress();
    CHECK(progress.forwarded == 3);
    CHECK(progress.queueDepth == 0);
    CHECK(progress.trigger == SessionBatchTrigger::Stop);
    CHECK(workflow.generation() == 1);
    CHECK(library.size() == 1);
    const std::size_t fileSyncs = io.fileSyncs();
    const std::size_t directorySyncs = io.directorySyncs();
    CHECK(pipeline.stopAndCommit(4001) ==
          SurveyPipelineStatus::AlreadyCommitted);
    CHECK(io.fileSyncs() == fileSyncs);
    CHECK(io.directorySyncs() == directorySyncs);

    CHECK(pipeline.resetToSetup() == SurveyPipelineStatus::Ready);
    CHECK(pipeline.start("pipeline-capacity", 5000) ==
          SurveyPipelineStatus::Started);
    Observation observation = *golden.get(0);
    for (std::size_t index = 0;
         index < SurveySession::kObservationCapacity + 1U; ++index) {
        observation.monotonicUs = 6000 + index;
        const SurveyPipelineStatus status = pipeline.enqueue(observation);
        CHECK(status == (index < SurveySession::kObservationCapacity
                             ? SurveyPipelineStatus::Queued
                             : SurveyPipelineStatus::Dropped));
    }
    progress = pipeline.progress();
    CHECK(progress.received == SurveySession::kObservationCapacity + 1U);
    CHECK(progress.queued == SurveySession::kObservationCapacity);
    CHECK(progress.dropped == 1);
    CHECK(progress.queueDepth == SurveySession::kObservationCapacity);
    CHECK(progress.queueHighWater == SurveySession::kObservationCapacity);
    CHECK(pipeline.stopAndCommit(8000) == SurveyPipelineStatus::Committed);
    progress = pipeline.progress();
    CHECK(progress.forwarded == SurveySession::kObservationCapacity);
    CHECK(progress.dropped == 1);
    CHECK(progress.rejected == 0);
    CHECK(progress.trigger == SessionBatchTrigger::Stop);
    CHECK(workflow.generation() == 2);
    CHECK(library.selected() != nullptr &&
          library.selected()->session != nullptr &&
          library.selected()->session->size() ==
              SurveySession::kObservationCapacity);
    CHECK(std::strcmp(surveyPipelineStatusName(pipeline.lastStatus()),
                      "committed") == 0);
}

void testProductStorePolicySeparatesReadOnlyBootFromExplicitWrites() {
    constexpr ResourceMask storeResources =
        resourceMask(Resource::Storage) | resourceMask(Resource::RadioSpi);
    MediaIdentity media{true, MediaKind::Sd, "0123456789ABCDEF", 1024U * 1024U,
                        768U * 1024U};
    ProductStoreRequest recovery;
    recovery.operation = ProductStoreOperation::RecoverCatalog;
    recovery.expectedFingerprint = "0123456789ABCDEF";
    recovery.rootPath = kProductSessionStoreRoot;
    recovery.rootExists = true;
    recovery.driverReadOnlyGuaranteed = true;
    recovery.ownedResources = storeResources;

    ProductStorePermit permit = authorizeProductStore(media, recovery);
    CHECK(permit.allowed());
    CHECK(!permit.writable);
    CHECK(permit.byteLimit == 0);
    CHECK(permit.operation == ProductStoreOperation::RecoverCatalog);
    CHECK(permit.requiredResources == storeResources);
    CHECK(std::strcmp(permit.rootPath, "/leshy/sessions/v1") == 0);
    CHECK(std::strcmp(productStoreOperationName(permit.operation),
                      "recover_catalog") == 0);

    ProductStoreRequest rejected = recovery;
    MediaIdentity missing = media;
    missing.present = false;
    CHECK(authorizeProductStore(missing, rejected).status ==
          ProductStoreAccessStatus::MissingMedia);
    MediaIdentity invalidGeometry = media;
    invalidGeometry.capacityBytes = 0;
    CHECK(authorizeProductStore(invalidGeometry, rejected).status ==
          ProductStoreAccessStatus::InvalidMediaGeometry);
    rejected.expectedFingerprint = "FEDCBA9876543210";
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::FingerprintMismatch);
    rejected = recovery;
    rejected.rootPath = "/leshy/sessions/v10";
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::InvalidRoot);
    rejected = recovery;
    rejected.rootExists = false;
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::RootMissing);
    rejected = recovery;
    rejected.driverReadOnlyGuaranteed = false;
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::ReadOnlyDriverRequired);
    rejected = recovery;
    rejected.driverWriteEnabled = true;
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::ReadOnlyDriverRequired);
    rejected = recovery;
    rejected.formatRequested = true;
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::FormatForbidden);
    rejected = recovery;
    rejected.ownedResources = resourceMask(Resource::Storage);
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::ResourcesMissing);
    rejected = recovery;
    rejected.conflictingOwner = true;
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::ResourceConflict);

    ProductStoreRequest initialize;
    initialize.operation = ProductStoreOperation::InitializeStore;
    initialize.explicitlySelected = true;
    initialize.expectedFingerprint = recovery.expectedFingerprint;
    initialize.rootPath = kProductSessionStoreRoot;
    initialize.rootExists = false;
    initialize.driverWriteEnabled = true;
    initialize.requiredBytes = 65536;
    initialize.reserveBytes = 65536;
    initialize.ownedResources = storeResources;
    permit = authorizeProductStore(media, initialize);
    CHECK(permit.allowed());
    CHECK(permit.writable);
    CHECK(permit.byteLimit == 65536);
    CHECK(permit.operation == ProductStoreOperation::InitializeStore);

    rejected = initialize;
    rejected.explicitlySelected = false;
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::ExplicitSelectionRequired);
    rejected = initialize;
    rejected.rootExists = true;
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::RootAlreadyExists);
    rejected = initialize;
    rejected.driverWriteEnabled = false;
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::WritableDriverRequired);
    rejected = initialize;
    rejected.requiredBytes = 0;
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::InvalidSize);
    rejected = initialize;
    rejected.requiredBytes = media.freeBytes;
    rejected.reserveBytes = 1;
    CHECK(authorizeProductStore(media, rejected).status ==
          ProductStoreAccessStatus::InsufficientSpace);

