anton-vinogradov/esp32-leshy/tests/native/clean_target_tests.cpp
    ProductStoreRequest commit = initialize;
    commit.operation = ProductStoreOperation::CommitSession;
    commit.rootExists = true;
    permit = authorizeProductStore(media, commit);
    CHECK(permit.allowed());
    CHECK(permit.writable);
    CHECK(permit.operation == ProductStoreOperation::CommitSession);
    CHECK(std::strcmp(productStoreAccessStatusName(permit.status),
                      "permitted") == 0);
}

void testProductSurveyAdmissionNeverFallsBackToSimulatedOrRam() {
    constexpr ResourceMask storeResources =
        resourceMask(Resource::Storage) | resourceMask(Resource::RadioSpi);
    constexpr ResourceMask surveyResources =
        storeResources | resourceMask(Resource::EspRf);
    MediaIdentity media{true, MediaKind::Sd, "0123456789ABCDEF", 1024U * 1024U,
                        768U * 1024U};
    ProductStoreRequest storeRequest;
    storeRequest.operation = ProductStoreOperation::CommitSession;
    storeRequest.explicitlySelected = true;
    storeRequest.expectedFingerprint = "0123456789ABCDEF";
    storeRequest.rootPath = kProductSessionStoreRoot;
    storeRequest.rootExists = true;
    storeRequest.driverWriteEnabled = true;
    storeRequest.requiredBytes = 65536;
    storeRequest.reserveBytes = 65536;
    storeRequest.ownedResources = storeResources;
    const ProductStorePermit store = authorizeProductStore(media, storeRequest);
    CHECK(store.allowed());

    ProductSurveyRequest request;
    request.explicitStart = true;
    request.sourceAvailable = true;
    request.scanPlan = defaultPassivePlan();
    request.storePermit = store;
    request.ownedResources = surveyResources;
    ProductSurveyPermit permit = authorizeProductSurvey(request);
    CHECK(permit.allowed());
    CHECK(permit.passive);
    CHECK(permit.persistent);
    CHECK(!permit.simulated);
    CHECK(permit.requiredResources == surveyResources);
    CHECK(permit.selectedSourceMask == 1);
    CHECK(permit.availableSourceMask == 1);
    CHECK(permit.degradedSourceMask == 0);

    request.selectedSourceMask = 3;
    request.availableSourceMask = 1;
    permit = authorizeProductSurvey(request);
    CHECK(permit.allowed());
    CHECK(permit.selectedSourceMask == 3);
    CHECK(permit.availableSourceMask == 1);
    CHECK(permit.degradedSourceMask == 2);
    request.availableSourceMask = 3;
    permit = authorizeProductSurvey(request);
    CHECK(permit.allowed());
    request.selectedSourceMask = 2;
    request.availableSourceMask = 2;
    request.scanPlan.passive = false;
    permit = authorizeProductSurvey(request);
    CHECK(permit.allowed());
    request.scanPlan = defaultPassivePlan();
    request.selectedSourceMask = 3;
    request.availableSourceMask = 3;

    ProductSurveyRequest rejected = request;
    rejected.explicitStart = false;
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::ExplicitStartRequired);
    rejected = request;
    rejected.sourceAvailable = false;
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::SourceUnavailable);
    rejected = request;
    rejected.selectedSourceMask = 0;
    rejected.availableSourceMask = 0;
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::SourceUnavailable);
    rejected = request;
    rejected.availableSourceMask = 4;
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::SourceUnavailable);
    rejected = request;
    rejected.scanPlan.passive = false;
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::PassivePlanRejected);
    rejected = request;
    rejected.bleScanPlan.passive = false;
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::PassivePlanRejected);
    rejected = request;
    rejected.storePermit.status = ProductStoreAccessStatus::MissingMedia;
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::StoreRejected);
    rejected = request;
    rejected.storePermit.rootPath = "/leshy/sessions/v10";
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::StoreRejected);
    rejected = request;
    rejected.storePermit.requiredResources = resourceMask(Resource::Storage);
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::StoreRejected);
    rejected = request;
    rejected.storePermit.byteLimit = 0;
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::StoreRejected);
    rejected = request;
    rejected.storePermit.operation = ProductStoreOperation::RecoverCatalog;
    rejected.storePermit.writable = false;
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::WritableStoreRequired);
    rejected = request;
    rejected.ownedResources = storeResources;
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::ResourcesMissing);
    rejected = request;
    rejected.conflictingOwner = true;
    CHECK(authorizeProductSurvey(rejected).status ==
          ProductSurveyAdmissionStatus::ResourceConflict);
    CHECK(std::strcmp(productSurveyAdmissionStatusName(
                          ProductSurveyAdmissionStatus::StoreRejected),
                      "store_rejected") == 0);
}

HeadCandidate candidate(const std::uint8_t* wire, const HeadRecord& record,
                        bool present = true, bool matching = true) {
    return {wire,
            kHeadWireSize,
            {present, record.manifestLength,
             matching ? record.manifestCrc32c
                      : static_cast<std::uint32_t>(record.manifestCrc32c ^ 1U)}};
}

void testHeadEncodingAndRecoveryRejectsUncommittedData() {
    static constexpr std::uint8_t kCrcVector[] = {'1', '2', '3', '4', '5', '6', '7', '8', '9'};
    CHECK(crc32c(kCrcVector, sizeof(kCrcVector)) == 0xE3069283U);

    const HeadRecord a{10, 1200, 0x11223344U};
    const HeadRecord b{11, 1300, 0x55667788U};
    std::uint8_t aWire[kHeadWireSize] = {};
    std::uint8_t bWire[kHeadWireSize] = {};
    CHECK(encodeHead(a, aWire, sizeof(aWire)));
    CHECK(encodeHead(b, bWire, sizeof(bWire)));

    HeadRecord decoded;
    CHECK(decodeHead(aWire, sizeof(aWire), &decoded) == HeadDecodeStatus::Valid);
    CHECK(decoded.generation == 10);
    for (std::size_t size = 0; size < kHeadWireSize; ++size) {
        CHECK(decodeHead(aWire, size, &decoded) == HeadDecodeStatus::TooShort);
    }
    for (std::size_t byte = 0; byte < kHeadWireSize; ++byte) {
        for (std::uint8_t bit = 0; bit < 8; ++bit) {
            std::uint8_t corrupted[kHeadWireSize] = {};
            std::memcpy(corrupted, aWire, sizeof(corrupted));
            corrupted[byte] ^= static_cast<std::uint8_t>(1U << bit);
            CHECK(decodeHead(corrupted, sizeof(corrupted), &decoded) != HeadDecodeStatus::Valid);
        }
    }
    aWire[12] ^= 1U;
    CHECK(decodeHead(aWire, sizeof(aWire), &decoded) == HeadDecodeStatus::ChecksumMismatch);
    aWire[12] ^= 1U;

